Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1234 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xd005d): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xbe465): ../Core/Src/main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x5adc1): C:/Users/Administrator/STM32CubeIDE/workspace_1.3.0/pullgauge/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x6a7c9): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x3cc48): __uint8_t
    <35>   DW_AT_decl_file   : 4
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0xcecc7): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x9e5f5): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0xae547): __uint16_t
    <4f>   DW_AT_decl_file   : 4
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0xcd173): short unsigned int
 <1><5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 5	(signed)
    <60>   DW_AT_name        : (indirect string, offset: 0x11ba3): long int
 <1><64>: Abbrev Number: 3 (DW_TAG_typedef)
    <65>   DW_AT_name        : (indirect string, offset: 0x87c13): __uint32_t
    <69>   DW_AT_decl_file   : 4
    <6a>   DW_AT_decl_line   : 79
    <6b>   DW_AT_decl_column : 25
    <6c>   DW_AT_type        : <0x70>
 <1><70>: Abbrev Number: 2 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 4
    <72>   DW_AT_encoding    : 7	(unsigned)
    <73>   DW_AT_name        : (indirect string, offset: 0x508d1): long unsigned int
 <1><77>: Abbrev Number: 2 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 8
    <79>   DW_AT_encoding    : 5	(signed)
    <7a>   DW_AT_name        : (indirect string, offset: 0x60d76): long long int
 <1><7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 8
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0x2b9d8): long long unsigned int
 <1><85>: Abbrev Number: 4 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : int
 <1><8c>: Abbrev Number: 2 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x11199): unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_typedef)
    <94>   DW_AT_name        : (indirect string, offset: 0x3cc4a): uint8_t
    <98>   DW_AT_decl_file   : 5
    <99>   DW_AT_decl_line   : 24
    <9a>   DW_AT_decl_column : 19
    <9b>   DW_AT_type        : <0x30>
 <1><9f>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <a0>   DW_AT_type        : <0x93>
 <1><a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <a5>   DW_AT_name        : (indirect string, offset: 0x9cb5f): uint16_t
    <a9>   DW_AT_decl_file   : 5
    <aa>   DW_AT_decl_line   : 36
    <ab>   DW_AT_decl_column : 20
    <ac>   DW_AT_type        : <0x4a>
 <1><b0>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b1>   DW_AT_type        : <0xa4>
 <1><b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0x9ab42): uint32_t
    <ba>   DW_AT_decl_file   : 5
    <bb>   DW_AT_decl_line   : 48
    <bc>   DW_AT_decl_column : 20
    <bd>   DW_AT_type        : <0x64>
 <1><c1>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c2>   DW_AT_type        : <0xb5>
 <1><c6>: Abbrev Number: 6 (DW_TAG_const_type)
    <c7>   DW_AT_type        : <0xc1>
 <1><cb>: Abbrev Number: 7 (DW_TAG_union_type)
    <cc>   DW_AT_byte_size   : 4
    <cd>   DW_AT_decl_file   : 1
    <ce>   DW_AT_decl_line   : 813
    <d0>   DW_AT_decl_column : 9
    <d1>   DW_AT_sibling     : <0xfc>
 <2><d5>: Abbrev Number: 8 (DW_TAG_member)
    <d6>   DW_AT_name        : u8
    <d9>   DW_AT_decl_file   : 1
    <da>   DW_AT_decl_line   : 815
    <dc>   DW_AT_decl_column : 22
    <dd>   DW_AT_type        : <0x9f>
 <2><e1>: Abbrev Number: 8 (DW_TAG_member)
    <e2>   DW_AT_name        : u16
    <e6>   DW_AT_decl_file   : 1
    <e7>   DW_AT_decl_line   : 816
    <e9>   DW_AT_decl_column : 22
    <ea>   DW_AT_type        : <0xb0>
 <2><ee>: Abbrev Number: 8 (DW_TAG_member)
    <ef>   DW_AT_name        : u32
    <f3>   DW_AT_decl_file   : 1
    <f4>   DW_AT_decl_line   : 817
    <f6>   DW_AT_decl_column : 22
    <f7>   DW_AT_type        : <0xc1>
 <2><fb>: Abbrev Number: 0
 <1><fc>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <fd>   DW_AT_type        : <0xcb>
 <1><101>: Abbrev Number: 9 (DW_TAG_structure_type)
    <102>   DW_AT_byte_size   : 4096
    <104>   DW_AT_decl_file   : 1
    <105>   DW_AT_decl_line   : 811
    <107>   DW_AT_decl_column : 9
    <108>   DW_AT_sibling     : <0x273>
 <2><10c>: Abbrev Number: 10 (DW_TAG_member)
    <10d>   DW_AT_name        : (indirect string, offset: 0xd8538): PORT
    <111>   DW_AT_decl_file   : 1
    <112>   DW_AT_decl_line   : 818
    <114>   DW_AT_decl_column : 6
    <115>   DW_AT_type        : <0x283>
    <119>   DW_AT_data_member_location: 0
 <2><11a>: Abbrev Number: 10 (DW_TAG_member)
    <11b>   DW_AT_name        : (indirect string, offset: 0xc979c): RESERVED0
    <11f>   DW_AT_decl_file   : 1
    <120>   DW_AT_decl_line   : 819
    <122>   DW_AT_decl_column : 18
    <123>   DW_AT_type        : <0x288>
    <127>   DW_AT_data_member_location: 128
 <2><128>: Abbrev Number: 11 (DW_TAG_member)
    <129>   DW_AT_name        : TER
    <12d>   DW_AT_decl_file   : 1
    <12e>   DW_AT_decl_line   : 820
    <130>   DW_AT_decl_column : 18
    <131>   DW_AT_type        : <0xc1>
    <135>   DW_AT_data_member_location: 3584
 <2><137>: Abbrev Number: 12 (DW_TAG_member)
    <138>   DW_AT_name        : (indirect string, offset: 0xc97a6): RESERVED1
    <13c>   DW_AT_decl_file   : 1
    <13d>   DW_AT_decl_line   : 821
    <13f>   DW_AT_decl_column : 18
    <140>   DW_AT_type        : <0x299>
    <144>   DW_AT_data_member_location: 3588
 <2><146>: Abbrev Number: 11 (DW_TAG_member)
    <147>   DW_AT_name        : TPR
    <14b>   DW_AT_decl_file   : 1
    <14c>   DW_AT_decl_line   : 822
    <14e>   DW_AT_decl_column : 18
    <14f>   DW_AT_type        : <0xc1>
    <153>   DW_AT_data_member_location: 3648
 <2><155>: Abbrev Number: 12 (DW_TAG_member)
    <156>   DW_AT_name        : (indirect string, offset: 0xc97b0): RESERVED2
    <15a>   DW_AT_decl_file   : 1
    <15b>   DW_AT_decl_line   : 823
    <15d>   DW_AT_decl_column : 18
    <15e>   DW_AT_type        : <0x299>
    <162>   DW_AT_data_member_location: 3652
 <2><164>: Abbrev Number: 11 (DW_TAG_member)
    <165>   DW_AT_name        : TCR
    <169>   DW_AT_decl_file   : 1
    <16a>   DW_AT_decl_line   : 824
    <16c>   DW_AT_decl_column : 18
    <16d>   DW_AT_type        : <0xc1>
    <171>   DW_AT_data_member_location: 3712
 <2><173>: Abbrev Number: 12 (DW_TAG_member)
    <174>   DW_AT_name        : (indirect string, offset: 0xc97ba): RESERVED3
    <178>   DW_AT_decl_file   : 1
    <179>   DW_AT_decl_line   : 825
    <17b>   DW_AT_decl_column : 18
    <17c>   DW_AT_type        : <0x2a9>
    <180>   DW_AT_data_member_location: 3716
 <2><182>: Abbrev Number: 12 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0xc120a): RESERVED4
    <187>   DW_AT_decl_file   : 1
    <188>   DW_AT_decl_line   : 826
    <18a>   DW_AT_decl_column : 18
    <18b>   DW_AT_type        : <0x2b9>
    <18f>   DW_AT_data_member_location: 3844
 <2><191>: Abbrev Number: 11 (DW_TAG_member)
    <192>   DW_AT_name        : LAR
    <196>   DW_AT_decl_file   : 1
    <197>   DW_AT_decl_line   : 827
    <199>   DW_AT_decl_column : 18
    <19a>   DW_AT_type        : <0xc1>
    <19e>   DW_AT_data_member_location: 4016
 <2><1a0>: Abbrev Number: 11 (DW_TAG_member)
    <1a1>   DW_AT_name        : LSR
    <1a5>   DW_AT_decl_file   : 1
    <1a6>   DW_AT_decl_line   : 828
    <1a8>   DW_AT_decl_column : 18
    <1a9>   DW_AT_type        : <0xc6>
    <1ad>   DW_AT_data_member_location: 4020
 <2><1af>: Abbrev Number: 12 (DW_TAG_member)
    <1b0>   DW_AT_name        : (indirect string, offset: 0xc97e8): RESERVED5
    <1b4>   DW_AT_decl_file   : 1
    <1b5>   DW_AT_decl_line   : 829
    <1b7>   DW_AT_decl_column : 18
    <1b8>   DW_AT_type        : <0x2c9>
    <1bc>   DW_AT_data_member_location: 4024
 <2><1be>: Abbrev Number: 12 (DW_TAG_member)
    <1bf>   DW_AT_name        : (indirect string, offset: 0x545fa): PID4
    <1c3>   DW_AT_decl_file   : 1
    <1c4>   DW_AT_decl_line   : 830
    <1c6>   DW_AT_decl_column : 18
    <1c7>   DW_AT_type        : <0xc6>
    <1cb>   DW_AT_data_member_location: 4048
 <2><1cd>: Abbrev Number: 12 (DW_TAG_member)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x545ff): PID5
    <1d2>   DW_AT_decl_file   : 1
    <1d3>   DW_AT_decl_line   : 831
    <1d5>   DW_AT_decl_column : 18
    <1d6>   DW_AT_type        : <0xc6>
    <1da>   DW_AT_data_member_location: 4052
 <2><1dc>: Abbrev Number: 12 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x54604): PID6
    <1e1>   DW_AT_decl_file   : 1
    <1e2>   DW_AT_decl_line   : 832
    <1e4>   DW_AT_decl_column : 18
    <1e5>   DW_AT_type        : <0xc6>
    <1e9>   DW_AT_data_member_location: 4056
 <2><1eb>: Abbrev Number: 12 (DW_TAG_member)
    <1ec>   DW_AT_name        : (indirect string, offset: 0x54609): PID7
    <1f0>   DW_AT_decl_file   : 1
    <1f1>   DW_AT_decl_line   : 833
    <1f3>   DW_AT_decl_column : 18
    <1f4>   DW_AT_type        : <0xc6>
    <1f8>   DW_AT_data_member_location: 4060
 <2><1fa>: Abbrev Number: 12 (DW_TAG_member)
    <1fb>   DW_AT_name        : (indirect string, offset: 0xa86d3): PID0
    <1ff>   DW_AT_decl_file   : 1
    <200>   DW_AT_decl_line   : 834
    <202>   DW_AT_decl_column : 18
    <203>   DW_AT_type        : <0xc6>
    <207>   DW_AT_data_member_location: 4064
 <2><209>: Abbrev Number: 12 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0xa86ef): PID1
    <20e>   DW_AT_decl_file   : 1
    <20f>   DW_AT_decl_line   : 835
    <211>   DW_AT_decl_column : 18
    <212>   DW_AT_type        : <0xc6>
    <216>   DW_AT_data_member_location: 4068
 <2><218>: Abbrev Number: 12 (DW_TAG_member)
    <219>   DW_AT_name        : (indirect string, offset: 0x25943): PID2
    <21d>   DW_AT_decl_file   : 1
    <21e>   DW_AT_decl_line   : 836
    <220>   DW_AT_decl_column : 18
    <221>   DW_AT_type        : <0xc6>
    <225>   DW_AT_data_member_location: 4072
 <2><227>: Abbrev Number: 12 (DW_TAG_member)
    <228>   DW_AT_name        : (indirect string, offset: 0x545f5): PID3
    <22c>   DW_AT_decl_file   : 1
    <22d>   DW_AT_decl_line   : 837
    <22f>   DW_AT_decl_column : 18
    <230>   DW_AT_type        : <0xc6>
    <234>   DW_AT_data_member_location: 4076
 <2><236>: Abbrev Number: 12 (DW_TAG_member)
    <237>   DW_AT_name        : (indirect string, offset: 0x1dab): CID0
    <23b>   DW_AT_decl_file   : 1
    <23c>   DW_AT_decl_line   : 838
    <23e>   DW_AT_decl_column : 18
    <23f>   DW_AT_type        : <0xc6>
    <243>   DW_AT_data_member_location: 4080
 <2><245>: Abbrev Number: 12 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x1db0): CID1
    <24a>   DW_AT_decl_file   : 1
    <24b>   DW_AT_decl_line   : 839
    <24d>   DW_AT_decl_column : 18
    <24e>   DW_AT_type        : <0xc6>
    <252>   DW_AT_data_member_location: 4084
 <2><254>: Abbrev Number: 12 (DW_TAG_member)
    <255>   DW_AT_name        : (indirect string, offset: 0x1db5): CID2
    <259>   DW_AT_decl_file   : 1
    <25a>   DW_AT_decl_line   : 840
    <25c>   DW_AT_decl_column : 18
    <25d>   DW_AT_type        : <0xc6>
    <261>   DW_AT_data_member_location: 4088
 <2><263>: Abbrev Number: 12 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0x1dba): CID3
    <268>   DW_AT_decl_file   : 1
    <269>   DW_AT_decl_line   : 841
    <26b>   DW_AT_decl_column : 18
    <26c>   DW_AT_type        : <0xc6>
    <270>   DW_AT_data_member_location: 4092
 <2><272>: Abbrev Number: 0
 <1><273>: Abbrev Number: 13 (DW_TAG_array_type)
    <274>   DW_AT_type        : <0xfc>
    <278>   DW_AT_sibling     : <0x283>
 <2><27c>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <27d>   DW_AT_type        : <0x8c>
    <281>   DW_AT_upper_bound : 31
 <2><282>: Abbrev Number: 0
 <1><283>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <284>   DW_AT_type        : <0x273>
 <1><288>: Abbrev Number: 13 (DW_TAG_array_type)
    <289>   DW_AT_type        : <0xb5>
    <28d>   DW_AT_sibling     : <0x299>
 <2><291>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <292>   DW_AT_type        : <0x8c>
    <296>   DW_AT_upper_bound : 863
 <2><298>: Abbrev Number: 0
 <1><299>: Abbrev Number: 13 (DW_TAG_array_type)
    <29a>   DW_AT_type        : <0xb5>
    <29e>   DW_AT_sibling     : <0x2a9>
 <2><2a2>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <2a3>   DW_AT_type        : <0x8c>
    <2a7>   DW_AT_upper_bound : 14
 <2><2a8>: Abbrev Number: 0
 <1><2a9>: Abbrev Number: 13 (DW_TAG_array_type)
    <2aa>   DW_AT_type        : <0xb5>
    <2ae>   DW_AT_sibling     : <0x2b9>
 <2><2b2>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <2b3>   DW_AT_type        : <0x8c>
    <2b7>   DW_AT_upper_bound : 31
 <2><2b8>: Abbrev Number: 0
 <1><2b9>: Abbrev Number: 13 (DW_TAG_array_type)
    <2ba>   DW_AT_type        : <0xb5>
    <2be>   DW_AT_sibling     : <0x2c9>
 <2><2c2>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <2c3>   DW_AT_type        : <0x8c>
    <2c7>   DW_AT_upper_bound : 42
 <2><2c8>: Abbrev Number: 0
 <1><2c9>: Abbrev Number: 13 (DW_TAG_array_type)
    <2ca>   DW_AT_type        : <0xb5>
    <2ce>   DW_AT_sibling     : <0x2d9>
 <2><2d2>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <2d3>   DW_AT_type        : <0x8c>
    <2d7>   DW_AT_upper_bound : 5
 <2><2d8>: Abbrev Number: 0
 <1><2d9>: Abbrev Number: 16 (DW_TAG_typedef)
    <2da>   DW_AT_name        : (indirect string, offset: 0xae93e): ITM_Type
    <2de>   DW_AT_decl_file   : 1
    <2df>   DW_AT_decl_line   : 842
    <2e1>   DW_AT_decl_column : 3
    <2e2>   DW_AT_type        : <0x101>
 <1><2e6>: Abbrev Number: 17 (DW_TAG_structure_type)
    <2e7>   DW_AT_byte_size   : 16
    <2e8>   DW_AT_decl_file   : 6
    <2e9>   DW_AT_decl_line   : 366
    <2eb>   DW_AT_decl_column : 9
    <2ec>   DW_AT_sibling     : <0x329>
 <2><2f0>: Abbrev Number: 18 (DW_TAG_member)
    <2f1>   DW_AT_name        : CCR
    <2f5>   DW_AT_decl_file   : 6
    <2f6>   DW_AT_decl_line   : 368
    <2f8>   DW_AT_decl_column : 17
    <2f9>   DW_AT_type        : <0xc1>
    <2fd>   DW_AT_data_member_location: 0
 <2><2fe>: Abbrev Number: 10 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x3e341): CNDTR
    <303>   DW_AT_decl_file   : 6
    <304>   DW_AT_decl_line   : 369
    <306>   DW_AT_decl_column : 17
    <307>   DW_AT_type        : <0xc1>
    <30b>   DW_AT_data_member_location: 4
 <2><30c>: Abbrev Number: 10 (DW_TAG_member)
    <30d>   DW_AT_name        : (indirect string, offset: 0xcee46): CPAR
    <311>   DW_AT_decl_file   : 6
    <312>   DW_AT_decl_line   : 370
    <314>   DW_AT_decl_column : 17
    <315>   DW_AT_type        : <0xc1>
    <319>   DW_AT_data_member_location: 8
 <2><31a>: Abbrev Number: 10 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0x757f6): CMAR
    <31f>   DW_AT_decl_file   : 6
    <320>   DW_AT_decl_line   : 371
    <322>   DW_AT_decl_column : 17
    <323>   DW_AT_type        : <0xc1>
    <327>   DW_AT_data_member_location: 12
 <2><328>: Abbrev Number: 0
 <1><329>: Abbrev Number: 16 (DW_TAG_typedef)
    <32a>   DW_AT_name        : (indirect string, offset: 0xc988f): DMA_Channel_TypeDef
    <32e>   DW_AT_decl_file   : 6
    <32f>   DW_AT_decl_line   : 372
    <331>   DW_AT_decl_column : 3
    <332>   DW_AT_type        : <0x2e6>
 <1><336>: Abbrev Number: 17 (DW_TAG_structure_type)
    <337>   DW_AT_byte_size   : 8
    <338>   DW_AT_decl_file   : 6
    <339>   DW_AT_decl_line   : 374
    <33b>   DW_AT_decl_column : 9
    <33c>   DW_AT_sibling     : <0x35d>
 <2><340>: Abbrev Number: 18 (DW_TAG_member)
    <341>   DW_AT_name        : ISR
    <345>   DW_AT_decl_file   : 6
    <346>   DW_AT_decl_line   : 376
    <348>   DW_AT_decl_column : 17
    <349>   DW_AT_type        : <0xc1>
    <34d>   DW_AT_data_member_location: 0
 <2><34e>: Abbrev Number: 10 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0x95452): IFCR
    <353>   DW_AT_decl_file   : 6
    <354>   DW_AT_decl_line   : 377
    <356>   DW_AT_decl_column : 17
    <357>   DW_AT_type        : <0xc1>
    <35b>   DW_AT_data_member_location: 4
 <2><35c>: Abbrev Number: 0
 <1><35d>: Abbrev Number: 16 (DW_TAG_typedef)
    <35e>   DW_AT_name        : (indirect string, offset: 0x4c653): DMA_TypeDef
    <362>   DW_AT_decl_file   : 6
    <363>   DW_AT_decl_line   : 378
    <365>   DW_AT_decl_column : 3
    <366>   DW_AT_type        : <0x336>
 <1><36a>: Abbrev Number: 17 (DW_TAG_structure_type)
    <36b>   DW_AT_byte_size   : 156
    <36c>   DW_AT_decl_file   : 6
    <36d>   DW_AT_decl_line   : 610
    <36f>   DW_AT_decl_column : 9
    <370>   DW_AT_sibling     : <0x596>
 <2><374>: Abbrev Number: 18 (DW_TAG_member)
    <375>   DW_AT_name        : CR
    <378>   DW_AT_decl_file   : 6
    <379>   DW_AT_decl_line   : 612
    <37b>   DW_AT_decl_column : 17
    <37c>   DW_AT_type        : <0xc1>
    <380>   DW_AT_data_member_location: 0
 <2><381>: Abbrev Number: 10 (DW_TAG_member)
    <382>   DW_AT_name        : (indirect string, offset: 0x8f883): ICSCR
    <386>   DW_AT_decl_file   : 6
    <387>   DW_AT_decl_line   : 613
    <389>   DW_AT_decl_column : 17
    <38a>   DW_AT_type        : <0xc1>
    <38e>   DW_AT_data_member_location: 4
 <2><38f>: Abbrev Number: 10 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x44c8d): CFGR
    <394>   DW_AT_decl_file   : 6
    <395>   DW_AT_decl_line   : 614
    <397>   DW_AT_decl_column : 17
    <398>   DW_AT_type        : <0xc1>
    <39c>   DW_AT_data_member_location: 8
 <2><39d>: Abbrev Number: 10 (DW_TAG_member)
    <39e>   DW_AT_name        : (indirect string, offset: 0x95771): PLLCFGR
    <3a2>   DW_AT_decl_file   : 6
    <3a3>   DW_AT_decl_line   : 615
    <3a5>   DW_AT_decl_column : 17
    <3a6>   DW_AT_type        : <0xc1>
    <3aa>   DW_AT_data_member_location: 12
 <2><3ab>: Abbrev Number: 10 (DW_TAG_member)
    <3ac>   DW_AT_name        : (indirect string, offset: 0x44c86): PLLSAI1CFGR
    <3b0>   DW_AT_decl_file   : 6
    <3b1>   DW_AT_decl_line   : 616
    <3b3>   DW_AT_decl_column : 17
    <3b4>   DW_AT_type        : <0xc1>
    <3b8>   DW_AT_data_member_location: 16
 <2><3b9>: Abbrev Number: 10 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x80747): RESERVED
    <3be>   DW_AT_decl_file   : 6
    <3bf>   DW_AT_decl_line   : 617
    <3c1>   DW_AT_decl_column : 17
    <3c2>   DW_AT_type        : <0xb5>
    <3c6>   DW_AT_data_member_location: 20
 <2><3c7>: Abbrev Number: 10 (DW_TAG_member)
    <3c8>   DW_AT_name        : (indirect string, offset: 0x2a55): CIER
    <3cc>   DW_AT_decl_file   : 6
    <3cd>   DW_AT_decl_line   : 618
    <3cf>   DW_AT_decl_column : 17
    <3d0>   DW_AT_type        : <0xc1>
    <3d4>   DW_AT_data_member_location: 24
 <2><3d5>: Abbrev Number: 10 (DW_TAG_member)
    <3d6>   DW_AT_name        : (indirect string, offset: 0x3199): CIFR
    <3da>   DW_AT_decl_file   : 6
    <3db>   DW_AT_decl_line   : 619
    <3dd>   DW_AT_decl_column : 17
    <3de>   DW_AT_type        : <0xc1>
    <3e2>   DW_AT_data_member_location: 28
 <2><3e3>: Abbrev Number: 10 (DW_TAG_member)
    <3e4>   DW_AT_name        : (indirect string, offset: 0x1a84): CICR
    <3e8>   DW_AT_decl_file   : 6
    <3e9>   DW_AT_decl_line   : 620
    <3eb>   DW_AT_decl_column : 17
    <3ec>   DW_AT_type        : <0xc1>
    <3f0>   DW_AT_data_member_location: 32
 <2><3f1>: Abbrev Number: 10 (DW_TAG_member)
    <3f2>   DW_AT_name        : (indirect string, offset: 0xc979c): RESERVED0
    <3f6>   DW_AT_decl_file   : 6
    <3f7>   DW_AT_decl_line   : 621
    <3f9>   DW_AT_decl_column : 17
    <3fa>   DW_AT_type        : <0xb5>
    <3fe>   DW_AT_data_member_location: 36
 <2><3ff>: Abbrev Number: 10 (DW_TAG_member)
    <400>   DW_AT_name        : (indirect string, offset: 0xa9d9d): AHB1RSTR
    <404>   DW_AT_decl_file   : 6
    <405>   DW_AT_decl_line   : 622
    <407>   DW_AT_decl_column : 17
    <408>   DW_AT_type        : <0xc1>
    <40c>   DW_AT_data_member_location: 40
 <2><40d>: Abbrev Number: 10 (DW_TAG_member)
    <40e>   DW_AT_name        : (indirect string, offset: 0x26ddd): AHB2RSTR
    <412>   DW_AT_decl_file   : 6
    <413>   DW_AT_decl_line   : 623
    <415>   DW_AT_decl_column : 17
    <416>   DW_AT_type        : <0xc1>
    <41a>   DW_AT_data_member_location: 44
 <2><41b>: Abbrev Number: 10 (DW_TAG_member)
    <41c>   DW_AT_name        : (indirect string, offset: 0x5c241): AHB3RSTR
    <420>   DW_AT_decl_file   : 6
    <421>   DW_AT_decl_line   : 624
    <423>   DW_AT_decl_column : 17
    <424>   DW_AT_type        : <0xc1>
    <428>   DW_AT_data_member_location: 48
 <2><429>: Abbrev Number: 10 (DW_TAG_member)
    <42a>   DW_AT_name        : (indirect string, offset: 0xc97a6): RESERVED1
    <42e>   DW_AT_decl_file   : 6
    <42f>   DW_AT_decl_line   : 625
    <431>   DW_AT_decl_column : 17
    <432>   DW_AT_type        : <0xb5>
    <436>   DW_AT_data_member_location: 52
 <2><437>: Abbrev Number: 10 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0x2a900): APB1RSTR1
    <43c>   DW_AT_decl_file   : 6
    <43d>   DW_AT_decl_line   : 626
    <43f>   DW_AT_decl_column : 17
    <440>   DW_AT_type        : <0xc1>
    <444>   DW_AT_data_member_location: 56
 <2><445>: Abbrev Number: 10 (DW_TAG_member)
    <446>   DW_AT_name        : (indirect string, offset: 0x2a90a): APB1RSTR2
    <44a>   DW_AT_decl_file   : 6
    <44b>   DW_AT_decl_line   : 627
    <44d>   DW_AT_decl_column : 17
    <44e>   DW_AT_type        : <0xc1>
    <452>   DW_AT_data_member_location: 60
 <2><453>: Abbrev Number: 10 (DW_TAG_member)
    <454>   DW_AT_name        : (indirect string, offset: 0x5bcae): APB2RSTR
    <458>   DW_AT_decl_file   : 6
    <459>   DW_AT_decl_line   : 628
    <45b>   DW_AT_decl_column : 17
    <45c>   DW_AT_type        : <0xc1>
    <460>   DW_AT_data_member_location: 64
 <2><461>: Abbrev Number: 10 (DW_TAG_member)
    <462>   DW_AT_name        : (indirect string, offset: 0xc97b0): RESERVED2
    <466>   DW_AT_decl_file   : 6
    <467>   DW_AT_decl_line   : 629
    <469>   DW_AT_decl_column : 17
    <46a>   DW_AT_type        : <0xb5>
    <46e>   DW_AT_data_member_location: 68
 <2><46f>: Abbrev Number: 10 (DW_TAG_member)
    <470>   DW_AT_name        : (indirect string, offset: 0x11134): AHB1ENR
    <474>   DW_AT_decl_file   : 6
    <475>   DW_AT_decl_line   : 630
    <477>   DW_AT_decl_column : 17
    <478>   DW_AT_type        : <0xc1>
    <47c>   DW_AT_data_member_location: 72
 <2><47d>: Abbrev Number: 10 (DW_TAG_member)
    <47e>   DW_AT_name        : (indirect string, offset: 0x37a13): AHB2ENR
    <482>   DW_AT_decl_file   : 6
    <483>   DW_AT_decl_line   : 631
    <485>   DW_AT_decl_column : 17
    <486>   DW_AT_type        : <0xc1>
    <48a>   DW_AT_data_member_location: 76
 <2><48b>: Abbrev Number: 10 (DW_TAG_member)
    <48c>   DW_AT_name        : (indirect string, offset: 0x5f239): AHB3ENR
    <490>   DW_AT_decl_file   : 6
    <491>   DW_AT_decl_line   : 632
    <493>   DW_AT_decl_column : 17
    <494>   DW_AT_type        : <0xc1>
    <498>   DW_AT_data_member_location: 80
 <2><499>: Abbrev Number: 10 (DW_TAG_member)
    <49a>   DW_AT_name        : (indirect string, offset: 0xc97ba): RESERVED3
    <49e>   DW_AT_decl_file   : 6
    <49f>   DW_AT_decl_line   : 633
    <4a1>   DW_AT_decl_column : 17
    <4a2>   DW_AT_type        : <0xb5>
    <4a6>   DW_AT_data_member_location: 84
 <2><4a7>: Abbrev Number: 10 (DW_TAG_member)
    <4a8>   DW_AT_name        : (indirect string, offset: 0x71f1): APB1ENR1
    <4ac>   DW_AT_decl_file   : 6
    <4ad>   DW_AT_decl_line   : 634
    <4af>   DW_AT_decl_column : 17
    <4b0>   DW_AT_type        : <0xc1>
    <4b4>   DW_AT_data_member_location: 88
 <2><4b5>: Abbrev Number: 10 (DW_TAG_member)
    <4b6>   DW_AT_name        : (indirect string, offset: 0x71fa): APB1ENR2
    <4ba>   DW_AT_decl_file   : 6
    <4bb>   DW_AT_decl_line   : 635
    <4bd>   DW_AT_decl_column : 17
    <4be>   DW_AT_type        : <0xc1>
    <4c2>   DW_AT_data_member_location: 92
 <2><4c3>: Abbrev Number: 10 (DW_TAG_member)
    <4c4>   DW_AT_name        : (indirect string, offset: 0x18ba1): APB2ENR
    <4c8>   DW_AT_decl_file   : 6
    <4c9>   DW_AT_decl_line   : 636
    <4cb>   DW_AT_decl_column : 17
    <4cc>   DW_AT_type        : <0xc1>
    <4d0>   DW_AT_data_member_location: 96
 <2><4d1>: Abbrev Number: 10 (DW_TAG_member)
    <4d2>   DW_AT_name        : (indirect string, offset: 0xc120a): RESERVED4
    <4d6>   DW_AT_decl_file   : 6
    <4d7>   DW_AT_decl_line   : 637
    <4d9>   DW_AT_decl_column : 17
    <4da>   DW_AT_type        : <0xb5>
    <4de>   DW_AT_data_member_location: 100
 <2><4df>: Abbrev Number: 10 (DW_TAG_member)
    <4e0>   DW_AT_name        : (indirect string, offset: 0x61b11): AHB1SMENR
    <4e4>   DW_AT_decl_file   : 6
    <4e5>   DW_AT_decl_line   : 638
    <4e7>   DW_AT_decl_column : 17
    <4e8>   DW_AT_type        : <0xc1>
    <4ec>   DW_AT_data_member_location: 104
 <2><4ed>: Abbrev Number: 10 (DW_TAG_member)
    <4ee>   DW_AT_name        : (indirect string, offset: 0xc3c1e): AHB2SMENR
    <4f2>   DW_AT_decl_file   : 6
    <4f3>   DW_AT_decl_line   : 639
    <4f5>   DW_AT_decl_column : 17
    <4f6>   DW_AT_type        : <0xc1>
    <4fa>   DW_AT_data_member_location: 108
 <2><4fb>: Abbrev Number: 10 (DW_TAG_member)
    <4fc>   DW_AT_name        : (indirect string, offset: 0x4cbe9): AHB3SMENR
    <500>   DW_AT_decl_file   : 6
    <501>   DW_AT_decl_line   : 640
    <503>   DW_AT_decl_column : 17
    <504>   DW_AT_type        : <0xc1>
    <508>   DW_AT_data_member_location: 112
 <2><509>: Abbrev Number: 10 (DW_TAG_member)
    <50a>   DW_AT_name        : (indirect string, offset: 0xc97e8): RESERVED5
    <50e>   DW_AT_decl_file   : 6
    <50f>   DW_AT_decl_line   : 641
    <511>   DW_AT_decl_column : 17
    <512>   DW_AT_type        : <0xb5>
    <516>   DW_AT_data_member_location: 116
 <2><517>: Abbrev Number: 10 (DW_TAG_member)
    <518>   DW_AT_name        : (indirect string, offset: 0x7e54): APB1SMENR1
    <51c>   DW_AT_decl_file   : 6
    <51d>   DW_AT_decl_line   : 642
    <51f>   DW_AT_decl_column : 17
    <520>   DW_AT_type        : <0xc1>
    <524>   DW_AT_data_member_location: 120
 <2><525>: Abbrev Number: 10 (DW_TAG_member)
    <526>   DW_AT_name        : (indirect string, offset: 0x7e5f): APB1SMENR2
    <52a>   DW_AT_decl_file   : 6
    <52b>   DW_AT_decl_line   : 643
    <52d>   DW_AT_decl_column : 17
    <52e>   DW_AT_type        : <0xc1>
    <532>   DW_AT_data_member_location: 124
 <2><533>: Abbrev Number: 10 (DW_TAG_member)
    <534>   DW_AT_name        : (indirect string, offset: 0xabea0): APB2SMENR
    <538>   DW_AT_decl_file   : 6
    <539>   DW_AT_decl_line   : 644
    <53b>   DW_AT_decl_column : 17
    <53c>   DW_AT_type        : <0xc1>
    <540>   DW_AT_data_member_location: 128
 <2><541>: Abbrev Number: 10 (DW_TAG_member)
    <542>   DW_AT_name        : (indirect string, offset: 0x7e57b): RESERVED6
    <546>   DW_AT_decl_file   : 6
    <547>   DW_AT_decl_line   : 645
    <549>   DW_AT_decl_column : 17
    <54a>   DW_AT_type        : <0xb5>
    <54e>   DW_AT_data_member_location: 132
 <2><54f>: Abbrev Number: 10 (DW_TAG_member)
    <550>   DW_AT_name        : (indirect string, offset: 0x3fb7a): CCIPR
    <554>   DW_AT_decl_file   : 6
    <555>   DW_AT_decl_line   : 646
    <557>   DW_AT_decl_column : 17
    <558>   DW_AT_type        : <0xc1>
    <55c>   DW_AT_data_member_location: 136
 <2><55d>: Abbrev Number: 10 (DW_TAG_member)
    <55e>   DW_AT_name        : (indirect string, offset: 0xc9823): RESERVED7
    <562>   DW_AT_decl_file   : 6
    <563>   DW_AT_decl_line   : 647
    <565>   DW_AT_decl_column : 17
    <566>   DW_AT_type        : <0xb5>
    <56a>   DW_AT_data_member_location: 140
 <2><56b>: Abbrev Number: 10 (DW_TAG_member)
    <56c>   DW_AT_name        : (indirect string, offset: 0x364e1): BDCR
    <570>   DW_AT_decl_file   : 6
    <571>   DW_AT_decl_line   : 648
    <573>   DW_AT_decl_column : 17
    <574>   DW_AT_type        : <0xc1>
    <578>   DW_AT_data_member_location: 144
 <2><579>: Abbrev Number: 18 (DW_TAG_member)
    <57a>   DW_AT_name        : CSR
    <57e>   DW_AT_decl_file   : 6
    <57f>   DW_AT_decl_line   : 649
    <581>   DW_AT_decl_column : 17
    <582>   DW_AT_type        : <0xc1>
    <586>   DW_AT_data_member_location: 148
 <2><587>: Abbrev Number: 10 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0x38bdc): CRRCR
    <58c>   DW_AT_decl_file   : 6
    <58d>   DW_AT_decl_line   : 650
    <58f>   DW_AT_decl_column : 17
    <590>   DW_AT_type        : <0xc1>
    <594>   DW_AT_data_member_location: 152
 <2><595>: Abbrev Number: 0
 <1><596>: Abbrev Number: 16 (DW_TAG_typedef)
    <597>   DW_AT_name        : (indirect string, offset: 0x62374): RCC_TypeDef
    <59b>   DW_AT_decl_file   : 6
    <59c>   DW_AT_decl_line   : 651
    <59e>   DW_AT_decl_column : 3
    <59f>   DW_AT_type        : <0x36a>
 <1><5a3>: Abbrev Number: 17 (DW_TAG_structure_type)
    <5a4>   DW_AT_byte_size   : 104
    <5a5>   DW_AT_decl_file   : 6
    <5a6>   DW_AT_decl_line   : 819
    <5a8>   DW_AT_decl_column : 9
    <5a9>   DW_AT_sibling     : <0x719>
 <2><5ad>: Abbrev Number: 18 (DW_TAG_member)
    <5ae>   DW_AT_name        : CR1
    <5b2>   DW_AT_decl_file   : 6
    <5b3>   DW_AT_decl_line   : 821
    <5b5>   DW_AT_decl_column : 17
    <5b6>   DW_AT_type        : <0xc1>
    <5ba>   DW_AT_data_member_location: 0
 <2><5bb>: Abbrev Number: 18 (DW_TAG_member)
    <5bc>   DW_AT_name        : CR2
    <5c0>   DW_AT_decl_file   : 6
    <5c1>   DW_AT_decl_line   : 822
    <5c3>   DW_AT_decl_column : 17
    <5c4>   DW_AT_type        : <0xc1>
    <5c8>   DW_AT_data_member_location: 4
 <2><5c9>: Abbrev Number: 10 (DW_TAG_member)
    <5ca>   DW_AT_name        : (indirect string, offset: 0x54d1): SMCR
    <5ce>   DW_AT_decl_file   : 6
    <5cf>   DW_AT_decl_line   : 823
    <5d1>   DW_AT_decl_column : 17
    <5d2>   DW_AT_type        : <0xc1>
    <5d6>   DW_AT_data_member_location: 8
 <2><5d7>: Abbrev Number: 10 (DW_TAG_member)
    <5d8>   DW_AT_name        : (indirect string, offset: 0x435ed): DIER
    <5dc>   DW_AT_decl_file   : 6
    <5dd>   DW_AT_decl_line   : 824
    <5df>   DW_AT_decl_column : 17
    <5e0>   DW_AT_type        : <0xc1>
    <5e4>   DW_AT_data_member_location: 12
 <2><5e5>: Abbrev Number: 18 (DW_TAG_member)
    <5e6>   DW_AT_name        : SR
    <5e9>   DW_AT_decl_file   : 6
    <5ea>   DW_AT_decl_line   : 825
    <5ec>   DW_AT_decl_column : 17
    <5ed>   DW_AT_type        : <0xc1>
    <5f1>   DW_AT_data_member_location: 16
 <2><5f2>: Abbrev Number: 18 (DW_TAG_member)
    <5f3>   DW_AT_name        : EGR
    <5f7>   DW_AT_decl_file   : 6
    <5f8>   DW_AT_decl_line   : 826
    <5fa>   DW_AT_decl_column : 17
    <5fb>   DW_AT_type        : <0xc1>
    <5ff>   DW_AT_data_member_location: 20
 <2><600>: Abbrev Number: 10 (DW_TAG_member)
    <601>   DW_AT_name        : (indirect string, offset: 0x2879d): CCMR1
    <605>   DW_AT_decl_file   : 6
    <606>   DW_AT_decl_line   : 827
    <608>   DW_AT_decl_column : 17
    <609>   DW_AT_type        : <0xc1>
    <60d>   DW_AT_data_member_location: 24
 <2><60e>: Abbrev Number: 10 (DW_TAG_member)
    <60f>   DW_AT_name        : (indirect string, offset: 0x544d0): CCMR2
    <613>   DW_AT_decl_file   : 6
    <614>   DW_AT_decl_line   : 828
    <616>   DW_AT_decl_column : 17
    <617>   DW_AT_type        : <0xc1>
    <61b>   DW_AT_data_member_location: 28
 <2><61c>: Abbrev Number: 10 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0x32cfc): CCER
    <621>   DW_AT_decl_file   : 6
    <622>   DW_AT_decl_line   : 829
    <624>   DW_AT_decl_column : 17
    <625>   DW_AT_type        : <0xc1>
    <629>   DW_AT_data_member_location: 32
 <2><62a>: Abbrev Number: 18 (DW_TAG_member)
    <62b>   DW_AT_name        : CNT
    <62f>   DW_AT_decl_file   : 6
    <630>   DW_AT_decl_line   : 830
    <632>   DW_AT_decl_column : 17
    <633>   DW_AT_type        : <0xc1>
    <637>   DW_AT_data_member_location: 36
 <2><638>: Abbrev Number: 18 (DW_TAG_member)
    <639>   DW_AT_name        : PSC
    <63d>   DW_AT_decl_file   : 6
    <63e>   DW_AT_decl_line   : 831
    <640>   DW_AT_decl_column : 17
    <641>   DW_AT_type        : <0xc1>
    <645>   DW_AT_data_member_location: 40
 <2><646>: Abbrev Number: 18 (DW_TAG_member)
    <647>   DW_AT_name        : ARR
    <64b>   DW_AT_decl_file   : 6
    <64c>   DW_AT_decl_line   : 832
    <64e>   DW_AT_decl_column : 17
    <64f>   DW_AT_type        : <0xc1>
    <653>   DW_AT_data_member_location: 44
 <2><654>: Abbrev Number: 18 (DW_TAG_member)
    <655>   DW_AT_name        : RCR
    <659>   DW_AT_decl_file   : 6
    <65a>   DW_AT_decl_line   : 833
    <65c>   DW_AT_decl_column : 17
    <65d>   DW_AT_type        : <0xc1>
    <661>   DW_AT_data_member_location: 48
 <2><662>: Abbrev Number: 10 (DW_TAG_member)
    <663>   DW_AT_name        : (indirect string, offset: 0x18b9c): CCR1
    <667>   DW_AT_decl_file   : 6
    <668>   DW_AT_decl_line   : 834
    <66a>   DW_AT_decl_column : 17
    <66b>   DW_AT_type        : <0xc1>
    <66f>   DW_AT_data_member_location: 52
 <2><670>: Abbrev Number: 10 (DW_TAG_member)
    <671>   DW_AT_name        : (indirect string, offset: 0x587bb): CCR2
    <675>   DW_AT_decl_file   : 6
    <676>   DW_AT_decl_line   : 835
    <678>   DW_AT_decl_column : 17
    <679>   DW_AT_type        : <0xc1>
    <67d>   DW_AT_data_member_location: 56
 <2><67e>: Abbrev Number: 10 (DW_TAG_member)
    <67f>   DW_AT_name        : (indirect string, offset: 0x3b9ab): CCR3
    <683>   DW_AT_decl_file   : 6
    <684>   DW_AT_decl_line   : 836
    <686>   DW_AT_decl_column : 17
    <687>   DW_AT_type        : <0xc1>
    <68b>   DW_AT_data_member_location: 60
 <2><68c>: Abbrev Number: 10 (DW_TAG_member)
    <68d>   DW_AT_name        : (indirect string, offset: 0xd1ff): CCR4
    <691>   DW_AT_decl_file   : 6
    <692>   DW_AT_decl_line   : 837
    <694>   DW_AT_decl_column : 17
    <695>   DW_AT_type        : <0xc1>
    <699>   DW_AT_data_member_location: 64
 <2><69a>: Abbrev Number: 10 (DW_TAG_member)
    <69b>   DW_AT_name        : (indirect string, offset: 0x61ad1): BDTR
    <69f>   DW_AT_decl_file   : 6
    <6a0>   DW_AT_decl_line   : 838
    <6a2>   DW_AT_decl_column : 17
    <6a3>   DW_AT_type        : <0xc1>
    <6a7>   DW_AT_data_member_location: 68
 <2><6a8>: Abbrev Number: 18 (DW_TAG_member)
    <6a9>   DW_AT_name        : DCR
    <6ad>   DW_AT_decl_file   : 6
    <6ae>   DW_AT_decl_line   : 839
    <6b0>   DW_AT_decl_column : 17
    <6b1>   DW_AT_type        : <0xc1>
    <6b5>   DW_AT_data_member_location: 72
 <2><6b6>: Abbrev Number: 10 (DW_TAG_member)
    <6b7>   DW_AT_name        : (indirect string, offset: 0xb7c83): DMAR
    <6bb>   DW_AT_decl_file   : 6
    <6bc>   DW_AT_decl_line   : 840
    <6be>   DW_AT_decl_column : 17
    <6bf>   DW_AT_type        : <0xc1>
    <6c3>   DW_AT_data_member_location: 76
 <2><6c4>: Abbrev Number: 18 (DW_TAG_member)
    <6c5>   DW_AT_name        : OR1
    <6c9>   DW_AT_decl_file   : 6
    <6ca>   DW_AT_decl_line   : 841
    <6cc>   DW_AT_decl_column : 17
    <6cd>   DW_AT_type        : <0xc1>
    <6d1>   DW_AT_data_member_location: 80
 <2><6d2>: Abbrev Number: 10 (DW_TAG_member)
    <6d3>   DW_AT_name        : (indirect string, offset: 0xbe5d6): CCMR3
    <6d7>   DW_AT_decl_file   : 6
    <6d8>   DW_AT_decl_line   : 842
    <6da>   DW_AT_decl_column : 17
    <6db>   DW_AT_type        : <0xc1>
    <6df>   DW_AT_data_member_location: 84
 <2><6e0>: Abbrev Number: 10 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0x25066): CCR5
    <6e5>   DW_AT_decl_file   : 6
    <6e6>   DW_AT_decl_line   : 843
    <6e8>   DW_AT_decl_column : 17
    <6e9>   DW_AT_type        : <0xc1>
    <6ed>   DW_AT_data_member_location: 88
 <2><6ee>: Abbrev Number: 10 (DW_TAG_member)
    <6ef>   DW_AT_name        : (indirect string, offset: 0x96902): CCR6
    <6f3>   DW_AT_decl_file   : 6
    <6f4>   DW_AT_decl_line   : 844
    <6f6>   DW_AT_decl_column : 17
    <6f7>   DW_AT_type        : <0xc1>
    <6fb>   DW_AT_data_member_location: 92
 <2><6fc>: Abbrev Number: 18 (DW_TAG_member)
    <6fd>   DW_AT_name        : OR2
    <701>   DW_AT_decl_file   : 6
    <702>   DW_AT_decl_line   : 845
    <704>   DW_AT_decl_column : 17
    <705>   DW_AT_type        : <0xc1>
    <709>   DW_AT_data_member_location: 96
 <2><70a>: Abbrev Number: 18 (DW_TAG_member)
    <70b>   DW_AT_name        : OR3
    <70f>   DW_AT_decl_file   : 6
    <710>   DW_AT_decl_line   : 846
    <712>   DW_AT_decl_column : 17
    <713>   DW_AT_type        : <0xc1>
    <717>   DW_AT_data_member_location: 100
 <2><718>: Abbrev Number: 0
 <1><719>: Abbrev Number: 16 (DW_TAG_typedef)
    <71a>   DW_AT_name        : (indirect string, offset: 0xca779): TIM_TypeDef
    <71e>   DW_AT_decl_file   : 6
    <71f>   DW_AT_decl_line   : 847
    <721>   DW_AT_decl_column : 3
    <722>   DW_AT_type        : <0x5a3>
 <1><726>: Abbrev Number: 2 (DW_TAG_base_type)
    <727>   DW_AT_byte_size   : 8
    <728>   DW_AT_encoding    : 4	(float)
    <729>   DW_AT_name        : (indirect string, offset: 0x13374): long double
 <1><72d>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <72e>   DW_AT_encoding    : 7	(unsigned)
    <72f>   DW_AT_byte_size   : 1
    <730>   DW_AT_type        : <0x3c>
    <734>   DW_AT_decl_file   : 7
    <735>   DW_AT_decl_line   : 39
    <736>   DW_AT_decl_column : 1
    <737>   DW_AT_sibling     : <0x754>
 <2><73b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <73c>   DW_AT_name        : (indirect string, offset: 0x468ef): HAL_OK
    <740>   DW_AT_const_value : 0
 <2><741>: Abbrev Number: 20 (DW_TAG_enumerator)
    <742>   DW_AT_name        : (indirect string, offset: 0x8513e): HAL_ERROR
    <746>   DW_AT_const_value : 1
 <2><747>: Abbrev Number: 20 (DW_TAG_enumerator)
    <748>   DW_AT_name        : (indirect string, offset: 0x2492f): HAL_BUSY
    <74c>   DW_AT_const_value : 2
 <2><74d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <74e>   DW_AT_name        : (indirect string, offset: 0x3d307): HAL_TIMEOUT
    <752>   DW_AT_const_value : 3
 <2><753>: Abbrev Number: 0
 <1><754>: Abbrev Number: 3 (DW_TAG_typedef)
    <755>   DW_AT_name        : (indirect string, offset: 0x2677): HAL_StatusTypeDef
    <759>   DW_AT_decl_file   : 7
    <75a>   DW_AT_decl_line   : 44
    <75b>   DW_AT_decl_column : 3
    <75c>   DW_AT_type        : <0x72d>
 <1><760>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <761>   DW_AT_encoding    : 7	(unsigned)
    <762>   DW_AT_byte_size   : 1
    <763>   DW_AT_type        : <0x3c>
    <767>   DW_AT_decl_file   : 7
    <768>   DW_AT_decl_line   : 50
    <769>   DW_AT_decl_column : 1
    <76a>   DW_AT_sibling     : <0x77b>
 <2><76e>: Abbrev Number: 20 (DW_TAG_enumerator)
    <76f>   DW_AT_name        : (indirect string, offset: 0x9d58f): HAL_UNLOCKED
    <773>   DW_AT_const_value : 0
 <2><774>: Abbrev Number: 20 (DW_TAG_enumerator)
    <775>   DW_AT_name        : (indirect string, offset: 0xd5d33): HAL_LOCKED
    <779>   DW_AT_const_value : 1
 <2><77a>: Abbrev Number: 0
 <1><77b>: Abbrev Number: 3 (DW_TAG_typedef)
    <77c>   DW_AT_name        : (indirect string, offset: 0x7d1b0): HAL_LockTypeDef
    <780>   DW_AT_decl_file   : 7
    <781>   DW_AT_decl_line   : 53
    <782>   DW_AT_decl_column : 3
    <783>   DW_AT_type        : <0x760>
 <1><787>: Abbrev Number: 21 (DW_TAG_structure_type)
    <788>   DW_AT_byte_size   : 28
    <789>   DW_AT_decl_file   : 8
    <78a>   DW_AT_decl_line   : 45
    <78b>   DW_AT_decl_column : 9
    <78c>   DW_AT_sibling     : <0x7ec>
 <2><790>: Abbrev Number: 22 (DW_TAG_member)
    <791>   DW_AT_name        : (indirect string, offset: 0x8f189): PLLState
    <795>   DW_AT_decl_file   : 8
    <796>   DW_AT_decl_line   : 47
    <797>   DW_AT_decl_column : 12
    <798>   DW_AT_type        : <0xb5>
    <79c>   DW_AT_data_member_location: 0
 <2><79d>: Abbrev Number: 22 (DW_TAG_member)
    <79e>   DW_AT_name        : (indirect string, offset: 0x94173): PLLSource
    <7a2>   DW_AT_decl_file   : 8
    <7a3>   DW_AT_decl_line   : 50
    <7a4>   DW_AT_decl_column : 12
    <7a5>   DW_AT_type        : <0xb5>
    <7a9>   DW_AT_data_member_location: 4
 <2><7aa>: Abbrev Number: 22 (DW_TAG_member)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x8a1a6): PLLM
    <7af>   DW_AT_decl_file   : 8
    <7b0>   DW_AT_decl_line   : 53
    <7b1>   DW_AT_decl_column : 12
    <7b2>   DW_AT_type        : <0xb5>
    <7b6>   DW_AT_data_member_location: 8
 <2><7b7>: Abbrev Number: 22 (DW_TAG_member)
    <7b8>   DW_AT_name        : (indirect string, offset: 0xb0d55): PLLN
    <7bc>   DW_AT_decl_file   : 8
    <7bd>   DW_AT_decl_line   : 57
    <7be>   DW_AT_decl_column : 12
    <7bf>   DW_AT_type        : <0xb5>
    <7c3>   DW_AT_data_member_location: 12
 <2><7c4>: Abbrev Number: 22 (DW_TAG_member)
    <7c5>   DW_AT_name        : (indirect string, offset: 0xb0d8b): PLLP
    <7c9>   DW_AT_decl_file   : 8
    <7ca>   DW_AT_decl_line   : 61
    <7cb>   DW_AT_decl_column : 12
    <7cc>   DW_AT_type        : <0xb5>
    <7d0>   DW_AT_data_member_location: 16
 <2><7d1>: Abbrev Number: 22 (DW_TAG_member)
    <7d2>   DW_AT_name        : (indirect string, offset: 0x4e0e7): PLLQ
    <7d6>   DW_AT_decl_file   : 8
    <7d7>   DW_AT_decl_line   : 65
    <7d8>   DW_AT_decl_column : 12
    <7d9>   DW_AT_type        : <0xb5>
    <7dd>   DW_AT_data_member_location: 20
 <2><7de>: Abbrev Number: 22 (DW_TAG_member)
    <7df>   DW_AT_name        : (indirect string, offset: 0xb0d90): PLLR
    <7e3>   DW_AT_decl_file   : 8
    <7e4>   DW_AT_decl_line   : 68
    <7e5>   DW_AT_decl_column : 12
    <7e6>   DW_AT_type        : <0xb5>
    <7ea>   DW_AT_data_member_location: 24
 <2><7eb>: Abbrev Number: 0
 <1><7ec>: Abbrev Number: 3 (DW_TAG_typedef)
    <7ed>   DW_AT_name        : (indirect string, offset: 0x807bb): RCC_PLLInitTypeDef
    <7f1>   DW_AT_decl_file   : 8
    <7f2>   DW_AT_decl_line   : 73
    <7f3>   DW_AT_decl_column : 2
    <7f4>   DW_AT_type        : <0x787>
 <1><7f8>: Abbrev Number: 21 (DW_TAG_structure_type)
    <7f9>   DW_AT_byte_size   : 68
    <7fa>   DW_AT_decl_file   : 8
    <7fb>   DW_AT_decl_line   : 78
    <7fc>   DW_AT_decl_column : 9
    <7fd>   DW_AT_sibling     : <0x891>
 <2><801>: Abbrev Number: 22 (DW_TAG_member)
    <802>   DW_AT_name        : (indirect string, offset: 0xadd35): OscillatorType
    <806>   DW_AT_decl_file   : 8
    <807>   DW_AT_decl_line   : 80
    <808>   DW_AT_decl_column : 12
    <809>   DW_AT_type        : <0xb5>
    <80d>   DW_AT_data_member_location: 0
 <2><80e>: Abbrev Number: 22 (DW_TAG_member)
    <80f>   DW_AT_name        : (indirect string, offset: 0x90982): HSEState
    <813>   DW_AT_decl_file   : 8
    <814>   DW_AT_decl_line   : 83
    <815>   DW_AT_decl_column : 12
    <816>   DW_AT_type        : <0xb5>
    <81a>   DW_AT_data_member_location: 4
 <2><81b>: Abbrev Number: 22 (DW_TAG_member)
    <81c>   DW_AT_name        : (indirect string, offset: 0x85dbc): LSEState
    <820>   DW_AT_decl_file   : 8
    <821>   DW_AT_decl_line   : 86
    <822>   DW_AT_decl_column : 12
    <823>   DW_AT_type        : <0xb5>
    <827>   DW_AT_data_member_location: 8
 <2><828>: Abbrev Number: 22 (DW_TAG_member)
    <829>   DW_AT_name        : (indirect string, offset: 0x5e814): HSIState
    <82d>   DW_AT_decl_file   : 8
    <82e>   DW_AT_decl_line   : 89
    <82f>   DW_AT_decl_column : 12
    <830>   DW_AT_type        : <0xb5>
    <834>   DW_AT_data_member_location: 12
 <2><835>: Abbrev Number: 22 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0xb7eee): HSICalibrationValue
    <83a>   DW_AT_decl_file   : 8
    <83b>   DW_AT_decl_line   : 92
    <83c>   DW_AT_decl_column : 12
    <83d>   DW_AT_type        : <0xb5>
    <841>   DW_AT_data_member_location: 16
 <2><842>: Abbrev Number: 22 (DW_TAG_member)
    <843>   DW_AT_name        : (indirect string, offset: 0x4928c): LSIState
    <847>   DW_AT_decl_file   : 8
    <848>   DW_AT_decl_line   : 98
    <849>   DW_AT_decl_column : 12
    <84a>   DW_AT_type        : <0xb5>
    <84e>   DW_AT_data_member_location: 20
 <2><84f>: Abbrev Number: 22 (DW_TAG_member)
    <850>   DW_AT_name        : (indirect string, offset: 0x46ae9): MSIState
    <854>   DW_AT_decl_file   : 8
    <855>   DW_AT_decl_line   : 106
    <856>   DW_AT_decl_column : 12
    <857>   DW_AT_type        : <0xb5>
    <85b>   DW_AT_data_member_location: 24
 <2><85c>: Abbrev Number: 22 (DW_TAG_member)
    <85d>   DW_AT_name        : (indirect string, offset: 0x3f8b9): MSICalibrationValue
    <861>   DW_AT_decl_file   : 8
    <862>   DW_AT_decl_line   : 109
    <863>   DW_AT_decl_column : 12
    <864>   DW_AT_type        : <0xb5>
    <868>   DW_AT_data_member_location: 28
 <2><869>: Abbrev Number: 22 (DW_TAG_member)
    <86a>   DW_AT_name        : (indirect string, offset: 0x6d195): MSIClockRange
    <86e>   DW_AT_decl_file   : 8
    <86f>   DW_AT_decl_line   : 112
    <870>   DW_AT_decl_column : 12
    <871>   DW_AT_type        : <0xb5>
    <875>   DW_AT_data_member_location: 32
 <2><876>: Abbrev Number: 22 (DW_TAG_member)
    <877>   DW_AT_name        : (indirect string, offset: 0x97194): HSI48State
    <87b>   DW_AT_decl_file   : 8
    <87c>   DW_AT_decl_line   : 115
    <87d>   DW_AT_decl_column : 12
    <87e>   DW_AT_type        : <0xb5>
    <882>   DW_AT_data_member_location: 36
 <2><883>: Abbrev Number: 23 (DW_TAG_member)
    <884>   DW_AT_name        : PLL
    <888>   DW_AT_decl_file   : 8
    <889>   DW_AT_decl_line   : 118
    <88a>   DW_AT_decl_column : 22
    <88b>   DW_AT_type        : <0x7ec>
    <88f>   DW_AT_data_member_location: 40
 <2><890>: Abbrev Number: 0
 <1><891>: Abbrev Number: 3 (DW_TAG_typedef)
    <892>   DW_AT_name        : (indirect string, offset: 0x70dd3): RCC_OscInitTypeDef
    <896>   DW_AT_decl_file   : 8
    <897>   DW_AT_decl_line   : 120
    <898>   DW_AT_decl_column : 2
    <899>   DW_AT_type        : <0x7f8>
 <1><89d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <89e>   DW_AT_byte_size   : 20
    <89f>   DW_AT_decl_file   : 8
    <8a0>   DW_AT_decl_line   : 125
    <8a1>   DW_AT_decl_column : 9
    <8a2>   DW_AT_sibling     : <0x8e8>
 <2><8a6>: Abbrev Number: 22 (DW_TAG_member)
    <8a7>   DW_AT_name        : (indirect string, offset: 0x3fb80): ClockType
    <8ab>   DW_AT_decl_file   : 8
    <8ac>   DW_AT_decl_line   : 127
    <8ad>   DW_AT_decl_column : 12
    <8ae>   DW_AT_type        : <0xb5>
    <8b2>   DW_AT_data_member_location: 0
 <2><8b3>: Abbrev Number: 22 (DW_TAG_member)
    <8b4>   DW_AT_name        : (indirect string, offset: 0x802df): SYSCLKSource
    <8b8>   DW_AT_decl_file   : 8
    <8b9>   DW_AT_decl_line   : 130
    <8ba>   DW_AT_decl_column : 12
    <8bb>   DW_AT_type        : <0xb5>
    <8bf>   DW_AT_data_member_location: 4
 <2><8c0>: Abbrev Number: 22 (DW_TAG_member)
    <8c1>   DW_AT_name        : (indirect string, offset: 0xb06f5): AHBCLKDivider
    <8c5>   DW_AT_decl_file   : 8
    <8c6>   DW_AT_decl_line   : 133
    <8c7>   DW_AT_decl_column : 12
    <8c8>   DW_AT_type        : <0xb5>
    <8cc>   DW_AT_data_member_location: 8
 <2><8cd>: Abbrev Number: 22 (DW_TAG_member)
    <8ce>   DW_AT_name        : (indirect string, offset: 0x80a8): APB1CLKDivider
    <8d2>   DW_AT_decl_file   : 8
    <8d3>   DW_AT_decl_line   : 136
    <8d4>   DW_AT_decl_column : 12
    <8d5>   DW_AT_type        : <0xb5>
    <8d9>   DW_AT_data_member_location: 12
 <2><8da>: Abbrev Number: 22 (DW_TAG_member)
    <8db>   DW_AT_name        : (indirect string, offset: 0x61335): APB2CLKDivider
    <8df>   DW_AT_decl_file   : 8
    <8e0>   DW_AT_decl_line   : 139
    <8e1>   DW_AT_decl_column : 12
    <8e2>   DW_AT_type        : <0xb5>
    <8e6>   DW_AT_data_member_location: 16
 <2><8e7>: Abbrev Number: 0
 <1><8e8>: Abbrev Number: 3 (DW_TAG_typedef)
    <8e9>   DW_AT_name        : (indirect string, offset: 0x3fbff): RCC_ClkInitTypeDef
    <8ed>   DW_AT_decl_file   : 8
    <8ee>   DW_AT_decl_line   : 142
    <8ef>   DW_AT_decl_column : 2
    <8f0>   DW_AT_type        : <0x89d>
 <1><8f4>: Abbrev Number: 21 (DW_TAG_structure_type)
    <8f5>   DW_AT_byte_size   : 32
    <8f6>   DW_AT_decl_file   : 9
    <8f7>   DW_AT_decl_line   : 46
    <8f8>   DW_AT_decl_column : 9
    <8f9>   DW_AT_sibling     : <0x966>
 <2><8fd>: Abbrev Number: 22 (DW_TAG_member)
    <8fe>   DW_AT_name        : (indirect string, offset: 0xdaf45): Request
    <902>   DW_AT_decl_file   : 9
    <903>   DW_AT_decl_line   : 48
    <904>   DW_AT_decl_column : 12
    <905>   DW_AT_type        : <0xb5>
    <909>   DW_AT_data_member_location: 0
 <2><90a>: Abbrev Number: 22 (DW_TAG_member)
    <90b>   DW_AT_name        : (indirect string, offset: 0xd979f): Direction
    <90f>   DW_AT_decl_file   : 9
    <910>   DW_AT_decl_line   : 51
    <911>   DW_AT_decl_column : 12
    <912>   DW_AT_type        : <0xb5>
    <916>   DW_AT_data_member_location: 4
 <2><917>: Abbrev Number: 22 (DW_TAG_member)
    <918>   DW_AT_name        : (indirect string, offset: 0xe047): PeriphInc
    <91c>   DW_AT_decl_file   : 9
    <91d>   DW_AT_decl_line   : 55
    <91e>   DW_AT_decl_column : 12
    <91f>   DW_AT_type        : <0xb5>
    <923>   DW_AT_data_member_location: 8
 <2><924>: Abbrev Number: 22 (DW_TAG_member)
    <925>   DW_AT_name        : (indirect string, offset: 0x2084d): MemInc
    <929>   DW_AT_decl_file   : 9
    <92a>   DW_AT_decl_line   : 58
    <92b>   DW_AT_decl_column : 12
    <92c>   DW_AT_type        : <0xb5>
    <930>   DW_AT_data_member_location: 12
 <2><931>: Abbrev Number: 22 (DW_TAG_member)
    <932>   DW_AT_name        : (indirect string, offset: 0x69bc9): PeriphDataAlignment
    <936>   DW_AT_decl_file   : 9
    <937>   DW_AT_decl_line   : 61
    <938>   DW_AT_decl_column : 12
    <939>   DW_AT_type        : <0xb5>
    <93d>   DW_AT_data_member_location: 16
 <2><93e>: Abbrev Number: 22 (DW_TAG_member)
    <93f>   DW_AT_name        : (indirect string, offset: 0xc0f46): MemDataAlignment
    <943>   DW_AT_decl_file   : 9
    <944>   DW_AT_decl_line   : 64
    <945>   DW_AT_decl_column : 12
    <946>   DW_AT_type        : <0xb5>
    <94a>   DW_AT_data_member_location: 20
 <2><94b>: Abbrev Number: 22 (DW_TAG_member)
    <94c>   DW_AT_name        : (indirect string, offset: 0xd88bf): Mode
    <950>   DW_AT_decl_file   : 9
    <951>   DW_AT_decl_line   : 67
    <952>   DW_AT_decl_column : 12
    <953>   DW_AT_type        : <0xb5>
    <957>   DW_AT_data_member_location: 24
 <2><958>: Abbrev Number: 22 (DW_TAG_member)
    <959>   DW_AT_name        : (indirect string, offset: 0xd7d29): Priority
    <95d>   DW_AT_decl_file   : 9
    <95e>   DW_AT_decl_line   : 72
    <95f>   DW_AT_decl_column : 12
    <960>   DW_AT_type        : <0xb5>
    <964>   DW_AT_data_member_location: 28
 <2><965>: Abbrev Number: 0
 <1><966>: Abbrev Number: 3 (DW_TAG_typedef)
    <967>   DW_AT_name        : (indirect string, offset: 0x38513): DMA_InitTypeDef
    <96b>   DW_AT_decl_file   : 9
    <96c>   DW_AT_decl_line   : 74
    <96d>   DW_AT_decl_column : 3
    <96e>   DW_AT_type        : <0x8f4>
 <1><972>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <973>   DW_AT_encoding    : 7	(unsigned)
    <974>   DW_AT_byte_size   : 1
    <975>   DW_AT_type        : <0x3c>
    <979>   DW_AT_decl_file   : 9
    <97a>   DW_AT_decl_line   : 80
    <97b>   DW_AT_decl_column : 1
    <97c>   DW_AT_sibling     : <0x999>
 <2><980>: Abbrev Number: 20 (DW_TAG_enumerator)
    <981>   DW_AT_name        : (indirect string, offset: 0x9e944): HAL_DMA_STATE_RESET
    <985>   DW_AT_const_value : 0
 <2><986>: Abbrev Number: 20 (DW_TAG_enumerator)
    <987>   DW_AT_name        : (indirect string, offset: 0x397bf): HAL_DMA_STATE_READY
    <98b>   DW_AT_const_value : 1
 <2><98c>: Abbrev Number: 20 (DW_TAG_enumerator)
    <98d>   DW_AT_name        : (indirect string, offset: 0x93a2c): HAL_DMA_STATE_BUSY
    <991>   DW_AT_const_value : 2
 <2><992>: Abbrev Number: 20 (DW_TAG_enumerator)
    <993>   DW_AT_name        : (indirect string, offset: 0xd2c71): HAL_DMA_STATE_TIMEOUT
    <997>   DW_AT_const_value : 3
 <2><998>: Abbrev Number: 0
 <1><999>: Abbrev Number: 3 (DW_TAG_typedef)
    <99a>   DW_AT_name        : (indirect string, offset: 0x8e39f): HAL_DMA_StateTypeDef
    <99e>   DW_AT_decl_file   : 9
    <99f>   DW_AT_decl_line   : 85
    <9a0>   DW_AT_decl_column : 2
    <9a1>   DW_AT_type        : <0x972>
 <1><9a5>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <9a6>   DW_AT_type        : <0x999>
 <1><9aa>: Abbrev Number: 24 (DW_TAG_structure_type)
    <9ab>   DW_AT_name        : (indirect string, offset: 0xb5d16): __DMA_HandleTypeDef
    <9af>   DW_AT_byte_size   : 72
    <9b0>   DW_AT_decl_file   : 9
    <9b1>   DW_AT_decl_line   : 112
    <9b2>   DW_AT_decl_column : 16
    <9b3>   DW_AT_sibling     : <0xa54>
 <2><9b7>: Abbrev Number: 22 (DW_TAG_member)
    <9b8>   DW_AT_name        : (indirect string, offset: 0xae310): Instance
    <9bc>   DW_AT_decl_file   : 9
    <9bd>   DW_AT_decl_line   : 114
    <9be>   DW_AT_decl_column : 27
    <9bf>   DW_AT_type        : <0xa54>
    <9c3>   DW_AT_data_member_location: 0
 <2><9c4>: Abbrev Number: 22 (DW_TAG_member)
    <9c5>   DW_AT_name        : (indirect string, offset: 0xd9791): Init
    <9c9>   DW_AT_decl_file   : 9
    <9ca>   DW_AT_decl_line   : 116
    <9cb>   DW_AT_decl_column : 25
    <9cc>   DW_AT_type        : <0x966>
    <9d0>   DW_AT_data_member_location: 4
 <2><9d1>: Abbrev Number: 22 (DW_TAG_member)
    <9d2>   DW_AT_name        : (indirect string, offset: 0x97c4a): Lock
    <9d6>   DW_AT_decl_file   : 9
    <9d7>   DW_AT_decl_line   : 118
    <9d8>   DW_AT_decl_column : 25
    <9d9>   DW_AT_type        : <0x77b>
    <9dd>   DW_AT_data_member_location: 36
 <2><9de>: Abbrev Number: 22 (DW_TAG_member)
    <9df>   DW_AT_name        : (indirect string, offset: 0xda83b): State
    <9e3>   DW_AT_decl_file   : 9
    <9e4>   DW_AT_decl_line   : 120
    <9e5>   DW_AT_decl_column : 30
    <9e6>   DW_AT_type        : <0x9a5>
    <9ea>   DW_AT_data_member_location: 37
 <2><9eb>: Abbrev Number: 22 (DW_TAG_member)
    <9ec>   DW_AT_name        : (indirect string, offset: 0x41a7d): Parent
    <9f0>   DW_AT_decl_file   : 9
    <9f1>   DW_AT_decl_line   : 122
    <9f2>   DW_AT_decl_column : 26
    <9f3>   DW_AT_type        : <0xa5a>
    <9f7>   DW_AT_data_member_location: 40
 <2><9f8>: Abbrev Number: 22 (DW_TAG_member)
    <9f9>   DW_AT_name        : (indirect string, offset: 0xd4e49): XferCpltCallback
    <9fd>   DW_AT_decl_file   : 9
    <9fe>   DW_AT_decl_line   : 124
    <9ff>   DW_AT_decl_column : 28
    <a00>   DW_AT_type        : <0xa6d>
    <a04>   DW_AT_data_member_location: 44
 <2><a05>: Abbrev Number: 22 (DW_TAG_member)
    <a06>   DW_AT_name        : (indirect string, offset: 0xa5a08): XferHalfCpltCallback
    <a0a>   DW_AT_decl_file   : 9
    <a0b>   DW_AT_decl_line   : 126
    <a0c>   DW_AT_decl_column : 28
    <a0d>   DW_AT_type        : <0xa6d>
    <a11>   DW_AT_data_member_location: 48
 <2><a12>: Abbrev Number: 22 (DW_TAG_member)
    <a13>   DW_AT_name        : (indirect string, offset: 0x1db60): XferErrorCallback
    <a17>   DW_AT_decl_file   : 9
    <a18>   DW_AT_decl_line   : 128
    <a19>   DW_AT_decl_column : 28
    <a1a>   DW_AT_type        : <0xa6d>
    <a1e>   DW_AT_data_member_location: 52
 <2><a1f>: Abbrev Number: 22 (DW_TAG_member)
    <a20>   DW_AT_name        : (indirect string, offset: 0xc795d): XferAbortCallback
    <a24>   DW_AT_decl_file   : 9
    <a25>   DW_AT_decl_line   : 130
    <a26>   DW_AT_decl_column : 28
    <a27>   DW_AT_type        : <0xa6d>
    <a2b>   DW_AT_data_member_location: 56
 <2><a2c>: Abbrev Number: 22 (DW_TAG_member)
    <a2d>   DW_AT_name        : (indirect string, offset: 0xd1551): ErrorCode
    <a31>   DW_AT_decl_file   : 9
    <a32>   DW_AT_decl_line   : 132
    <a33>   DW_AT_decl_column : 25
    <a34>   DW_AT_type        : <0xc1>
    <a38>   DW_AT_data_member_location: 60
 <2><a39>: Abbrev Number: 22 (DW_TAG_member)
    <a3a>   DW_AT_name        : (indirect string, offset: 0x55748): DmaBaseAddress
    <a3e>   DW_AT_decl_file   : 9
    <a3f>   DW_AT_decl_line   : 134
    <a40>   DW_AT_decl_column : 26
    <a41>   DW_AT_type        : <0xa73>
    <a45>   DW_AT_data_member_location: 64
 <2><a46>: Abbrev Number: 22 (DW_TAG_member)
    <a47>   DW_AT_name        : (indirect string, offset: 0xdf17): ChannelIndex
    <a4b>   DW_AT_decl_file   : 9
    <a4c>   DW_AT_decl_line   : 136
    <a4d>   DW_AT_decl_column : 25
    <a4e>   DW_AT_type        : <0xb5>
    <a52>   DW_AT_data_member_location: 68
 <2><a53>: Abbrev Number: 0
 <1><a54>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <a55>   DW_AT_byte_size   : 4
    <a56>   DW_AT_type        : <0x329>
 <1><a5a>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <a5b>   DW_AT_byte_size   : 4
 <1><a5c>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <a5d>   DW_AT_prototyped  : 1
    <a5d>   DW_AT_sibling     : <0xa67>
 <2><a61>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <a62>   DW_AT_type        : <0xa67>
 <2><a66>: Abbrev Number: 0
 <1><a67>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <a68>   DW_AT_byte_size   : 4
    <a69>   DW_AT_type        : <0x9aa>
 <1><a6d>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <a6e>   DW_AT_byte_size   : 4
    <a6f>   DW_AT_type        : <0xa5c>
 <1><a73>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <a74>   DW_AT_byte_size   : 4
    <a75>   DW_AT_type        : <0x35d>
 <1><a79>: Abbrev Number: 3 (DW_TAG_typedef)
    <a7a>   DW_AT_name        : (indirect string, offset: 0xb5d18): DMA_HandleTypeDef
    <a7e>   DW_AT_decl_file   : 9
    <a7f>   DW_AT_decl_line   : 153
    <a80>   DW_AT_decl_column : 2
    <a81>   DW_AT_type        : <0x9aa>
 <1><a85>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <a86>   DW_AT_byte_size   : 4
    <a87>   DW_AT_type        : <0xa79>
 <1><a8b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <a8c>   DW_AT_byte_size   : 24
    <a8d>   DW_AT_decl_file   : 10
    <a8e>   DW_AT_decl_line   : 46
    <a8f>   DW_AT_decl_column : 9
    <a90>   DW_AT_sibling     : <0xae3>
 <2><a94>: Abbrev Number: 22 (DW_TAG_member)
    <a95>   DW_AT_name        : (indirect string, offset: 0xd7083): Prescaler
    <a99>   DW_AT_decl_file   : 10
    <a9a>   DW_AT_decl_line   : 48
    <a9b>   DW_AT_decl_column : 12
    <a9c>   DW_AT_type        : <0xb5>
    <aa0>   DW_AT_data_member_location: 0
 <2><aa1>: Abbrev Number: 22 (DW_TAG_member)
    <aa2>   DW_AT_name        : (indirect string, offset: 0xc2182): CounterMode
    <aa6>   DW_AT_decl_file   : 10
    <aa7>   DW_AT_decl_line   : 51
    <aa8>   DW_AT_decl_column : 12
    <aa9>   DW_AT_type        : <0xb5>
    <aad>   DW_AT_data_member_location: 4
 <2><aae>: Abbrev Number: 22 (DW_TAG_member)
    <aaf>   DW_AT_name        : (indirect string, offset: 0xe0961): Period
    <ab3>   DW_AT_decl_file   : 10
    <ab4>   DW_AT_decl_line   : 54
    <ab5>   DW_AT_decl_column : 12
    <ab6>   DW_AT_type        : <0xb5>
    <aba>   DW_AT_data_member_location: 8
 <2><abb>: Abbrev Number: 22 (DW_TAG_member)
    <abc>   DW_AT_name        : (indirect string, offset: 0x55c31): ClockDivision
    <ac0>   DW_AT_decl_file   : 10
    <ac1>   DW_AT_decl_line   : 58
    <ac2>   DW_AT_decl_column : 12
    <ac3>   DW_AT_type        : <0xb5>
    <ac7>   DW_AT_data_member_location: 12
 <2><ac8>: Abbrev Number: 22 (DW_TAG_member)
    <ac9>   DW_AT_name        : (indirect string, offset: 0x9553d): RepetitionCounter
    <acd>   DW_AT_decl_file   : 10
    <ace>   DW_AT_decl_line   : 61
    <acf>   DW_AT_decl_column : 12
    <ad0>   DW_AT_type        : <0xb5>
    <ad4>   DW_AT_data_member_location: 16
 <2><ad5>: Abbrev Number: 22 (DW_TAG_member)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x1491b): AutoReloadPreload
    <ada>   DW_AT_decl_file   : 10
    <adb>   DW_AT_decl_line   : 72
    <adc>   DW_AT_decl_column : 12
    <add>   DW_AT_type        : <0xb5>
    <ae1>   DW_AT_data_member_location: 20
 <2><ae2>: Abbrev Number: 0
 <1><ae3>: Abbrev Number: 3 (DW_TAG_typedef)
    <ae4>   DW_AT_name        : (indirect string, offset: 0x482ff): TIM_Base_InitTypeDef
    <ae8>   DW_AT_decl_file   : 10
    <ae9>   DW_AT_decl_line   : 74
    <aea>   DW_AT_decl_column : 3
    <aeb>   DW_AT_type        : <0xa8b>
 <1><aef>: Abbrev Number: 29 (DW_TAG_enumeration_type)
    <af0>   DW_AT_encoding    : 7	(unsigned)
    <af1>   DW_AT_byte_size   : 1
    <af2>   DW_AT_type        : <0x3c>
    <af6>   DW_AT_decl_file   : 10
    <af7>   DW_AT_decl_line   : 301
    <af9>   DW_AT_decl_column : 1
    <afa>   DW_AT_sibling     : <0xb1d>
 <2><afe>: Abbrev Number: 20 (DW_TAG_enumerator)
    <aff>   DW_AT_name        : (indirect string, offset: 0x6b431): HAL_TIM_STATE_RESET
    <b03>   DW_AT_const_value : 0
 <2><b04>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b05>   DW_AT_name        : (indirect string, offset: 0x784c): HAL_TIM_STATE_READY
    <b09>   DW_AT_const_value : 1
 <2><b0a>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x349e2): HAL_TIM_STATE_BUSY
    <b0f>   DW_AT_const_value : 2
 <2><b10>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b11>   DW_AT_name        : (indirect string, offset: 0xb25e5): HAL_TIM_STATE_TIMEOUT
    <b15>   DW_AT_const_value : 3
 <2><b16>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b17>   DW_AT_name        : (indirect string, offset: 0x18561): HAL_TIM_STATE_ERROR
    <b1b>   DW_AT_const_value : 4
 <2><b1c>: Abbrev Number: 0
 <1><b1d>: Abbrev Number: 16 (DW_TAG_typedef)
    <b1e>   DW_AT_name        : (indirect string, offset: 0x8c2cd): HAL_TIM_StateTypeDef
    <b22>   DW_AT_decl_file   : 10
    <b23>   DW_AT_decl_line   : 307
    <b25>   DW_AT_decl_column : 3
    <b26>   DW_AT_type        : <0xaef>
 <1><b2a>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b2b>   DW_AT_type        : <0xb1d>
 <1><b2f>: Abbrev Number: 29 (DW_TAG_enumeration_type)
    <b30>   DW_AT_encoding    : 7	(unsigned)
    <b31>   DW_AT_byte_size   : 1
    <b32>   DW_AT_type        : <0x3c>
    <b36>   DW_AT_decl_file   : 10
    <b37>   DW_AT_decl_line   : 313
    <b39>   DW_AT_decl_column : 1
    <b3a>   DW_AT_sibling     : <0xb51>
 <2><b3e>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b3f>   DW_AT_name        : (indirect string, offset: 0xbbaf): HAL_TIM_CHANNEL_STATE_RESET
    <b43>   DW_AT_const_value : 0
 <2><b44>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b45>   DW_AT_name        : (indirect string, offset: 0x7cb36): HAL_TIM_CHANNEL_STATE_READY
    <b49>   DW_AT_const_value : 1
 <2><b4a>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b4b>   DW_AT_name        : (indirect string, offset: 0x882b2): HAL_TIM_CHANNEL_STATE_BUSY
    <b4f>   DW_AT_const_value : 2
 <2><b50>: Abbrev Number: 0
 <1><b51>: Abbrev Number: 16 (DW_TAG_typedef)
    <b52>   DW_AT_name        : (indirect string, offset: 0x2be7d): HAL_TIM_ChannelStateTypeDef
    <b56>   DW_AT_decl_file   : 10
    <b57>   DW_AT_decl_line   : 317
    <b59>   DW_AT_decl_column : 3
    <b5a>   DW_AT_type        : <0xb2f>
 <1><b5e>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b5f>   DW_AT_type        : <0xb51>
 <1><b63>: Abbrev Number: 29 (DW_TAG_enumeration_type)
    <b64>   DW_AT_encoding    : 7	(unsigned)
    <b65>   DW_AT_byte_size   : 1
    <b66>   DW_AT_type        : <0x3c>
    <b6a>   DW_AT_decl_file   : 10
    <b6b>   DW_AT_decl_line   : 323
    <b6d>   DW_AT_decl_column : 1
    <b6e>   DW_AT_sibling     : <0xb85>
 <2><b72>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b73>   DW_AT_name        : (indirect string, offset: 0x45be): HAL_DMA_BURST_STATE_RESET
    <b77>   DW_AT_const_value : 0
 <2><b78>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b79>   DW_AT_name        : (indirect string, offset: 0x75081): HAL_DMA_BURST_STATE_READY
    <b7d>   DW_AT_const_value : 1
 <2><b7e>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b7f>   DW_AT_name        : (indirect string, offset: 0x9fbe6): HAL_DMA_BURST_STATE_BUSY
    <b83>   DW_AT_const_value : 2
 <2><b84>: Abbrev Number: 0
 <1><b85>: Abbrev Number: 16 (DW_TAG_typedef)
    <b86>   DW_AT_name        : (indirect string, offset: 0x5345d): HAL_TIM_DMABurstStateTypeDef
    <b8a>   DW_AT_decl_file   : 10
    <b8b>   DW_AT_decl_line   : 327
    <b8d>   DW_AT_decl_column : 3
    <b8e>   DW_AT_type        : <0xb63>
 <1><b92>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b93>   DW_AT_type        : <0xb85>
 <1><b97>: Abbrev Number: 29 (DW_TAG_enumeration_type)
    <b98>   DW_AT_encoding    : 7	(unsigned)
    <b99>   DW_AT_byte_size   : 1
    <b9a>   DW_AT_type        : <0x3c>
    <b9e>   DW_AT_decl_file   : 10
    <b9f>   DW_AT_decl_line   : 333
    <ba1>   DW_AT_decl_column : 1
    <ba2>   DW_AT_sibling     : <0xbd1>
 <2><ba6>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ba7>   DW_AT_name        : (indirect string, offset: 0x77aa3): HAL_TIM_ACTIVE_CHANNEL_1
    <bab>   DW_AT_const_value : 1
 <2><bac>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bad>   DW_AT_name        : (indirect string, offset: 0x77abc): HAL_TIM_ACTIVE_CHANNEL_2
    <bb1>   DW_AT_const_value : 2
 <2><bb2>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x77ad5): HAL_TIM_ACTIVE_CHANNEL_3
    <bb7>   DW_AT_const_value : 4
 <2><bb8>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bb9>   DW_AT_name        : (indirect string, offset: 0x77aee): HAL_TIM_ACTIVE_CHANNEL_4
    <bbd>   DW_AT_const_value : 8
 <2><bbe>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x77b07): HAL_TIM_ACTIVE_CHANNEL_5
    <bc3>   DW_AT_const_value : 16
 <2><bc4>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x77b20): HAL_TIM_ACTIVE_CHANNEL_6
    <bc9>   DW_AT_const_value : 32
 <2><bca>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x56e44): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <bcf>   DW_AT_const_value : 0
 <2><bd0>: Abbrev Number: 0
 <1><bd1>: Abbrev Number: 16 (DW_TAG_typedef)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x6e876): HAL_TIM_ActiveChannel
    <bd6>   DW_AT_decl_file   : 10
    <bd7>   DW_AT_decl_line   : 341
    <bd9>   DW_AT_decl_column : 3
    <bda>   DW_AT_type        : <0xb97>
 <1><bde>: Abbrev Number: 17 (DW_TAG_structure_type)
    <bdf>   DW_AT_byte_size   : 76
    <be0>   DW_AT_decl_file   : 10
    <be1>   DW_AT_decl_line   : 349
    <be3>   DW_AT_decl_column : 9
    <be4>   DW_AT_sibling     : <0xc67>
 <2><be8>: Abbrev Number: 10 (DW_TAG_member)
    <be9>   DW_AT_name        : (indirect string, offset: 0xae310): Instance
    <bed>   DW_AT_decl_file   : 10
    <bee>   DW_AT_decl_line   : 352
    <bf0>   DW_AT_decl_column : 39
    <bf1>   DW_AT_type        : <0xc67>
    <bf5>   DW_AT_data_member_location: 0
 <2><bf6>: Abbrev Number: 10 (DW_TAG_member)
    <bf7>   DW_AT_name        : (indirect string, offset: 0xd9791): Init
    <bfb>   DW_AT_decl_file   : 10
    <bfc>   DW_AT_decl_line   : 353
    <bfe>   DW_AT_decl_column : 38
    <bff>   DW_AT_type        : <0xae3>
    <c03>   DW_AT_data_member_location: 4
 <2><c04>: Abbrev Number: 10 (DW_TAG_member)
    <c05>   DW_AT_name        : (indirect string, offset: 0x6e884): Channel
    <c09>   DW_AT_decl_file   : 10
    <c0a>   DW_AT_decl_line   : 354
    <c0c>   DW_AT_decl_column : 38
    <c0d>   DW_AT_type        : <0xbd1>
    <c11>   DW_AT_data_member_location: 28
 <2><c12>: Abbrev Number: 10 (DW_TAG_member)
    <c13>   DW_AT_name        : (indirect string, offset: 0x7f932): hdma
    <c17>   DW_AT_decl_file   : 10
    <c18>   DW_AT_decl_line   : 355
    <c1a>   DW_AT_decl_column : 39
    <c1b>   DW_AT_type        : <0xc6d>
    <c1f>   DW_AT_data_member_location: 32
 <2><c20>: Abbrev Number: 10 (DW_TAG_member)
    <c21>   DW_AT_name        : (indirect string, offset: 0x97c4a): Lock
    <c25>   DW_AT_decl_file   : 10
    <c26>   DW_AT_decl_line   : 357
    <c28>   DW_AT_decl_column : 38
    <c29>   DW_AT_type        : <0x77b>
    <c2d>   DW_AT_data_member_location: 60
 <2><c2e>: Abbrev Number: 10 (DW_TAG_member)
    <c2f>   DW_AT_name        : (indirect string, offset: 0xda83b): State
    <c33>   DW_AT_decl_file   : 10
    <c34>   DW_AT_decl_line   : 358
    <c36>   DW_AT_decl_column : 38
    <c37>   DW_AT_type        : <0xb2a>
    <c3b>   DW_AT_data_member_location: 61
 <2><c3c>: Abbrev Number: 10 (DW_TAG_member)
    <c3d>   DW_AT_name        : (indirect string, offset: 0xda4b0): ChannelState
    <c41>   DW_AT_decl_file   : 10
    <c42>   DW_AT_decl_line   : 359
    <c44>   DW_AT_decl_column : 38
    <c45>   DW_AT_type        : <0xc8d>
    <c49>   DW_AT_data_member_location: 62
 <2><c4a>: Abbrev Number: 10 (DW_TAG_member)
    <c4b>   DW_AT_name        : (indirect string, offset: 0xdabdc): ChannelNState
    <c4f>   DW_AT_decl_file   : 10
    <c50>   DW_AT_decl_line   : 360
    <c52>   DW_AT_decl_column : 38
    <c53>   DW_AT_type        : <0xca2>
    <c57>   DW_AT_data_member_location: 68
 <2><c58>: Abbrev Number: 10 (DW_TAG_member)
    <c59>   DW_AT_name        : (indirect string, offset: 0xda066): DMABurstState
    <c5d>   DW_AT_decl_file   : 10
    <c5e>   DW_AT_decl_line   : 361
    <c60>   DW_AT_decl_column : 38
    <c61>   DW_AT_type        : <0xb92>
    <c65>   DW_AT_data_member_location: 72
 <2><c66>: Abbrev Number: 0
 <1><c67>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <c68>   DW_AT_byte_size   : 4
    <c69>   DW_AT_type        : <0x719>
 <1><c6d>: Abbrev Number: 13 (DW_TAG_array_type)
    <c6e>   DW_AT_type        : <0xa85>
    <c72>   DW_AT_sibling     : <0xc7d>
 <2><c76>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <c77>   DW_AT_type        : <0x8c>
    <c7b>   DW_AT_upper_bound : 6
 <2><c7c>: Abbrev Number: 0
 <1><c7d>: Abbrev Number: 13 (DW_TAG_array_type)
    <c7e>   DW_AT_type        : <0xb5e>
    <c82>   DW_AT_sibling     : <0xc8d>
 <2><c86>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <c87>   DW_AT_type        : <0x8c>
    <c8b>   DW_AT_upper_bound : 5
 <2><c8c>: Abbrev Number: 0
 <1><c8d>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c8e>   DW_AT_type        : <0xc7d>
 <1><c92>: Abbrev Number: 13 (DW_TAG_array_type)
    <c93>   DW_AT_type        : <0xb5e>
    <c97>   DW_AT_sibling     : <0xca2>
 <2><c9b>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <c9c>   DW_AT_type        : <0x8c>
    <ca0>   DW_AT_upper_bound : 3
 <2><ca1>: Abbrev Number: 0
 <1><ca2>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <ca3>   DW_AT_type        : <0xc92>
 <1><ca7>: Abbrev Number: 16 (DW_TAG_typedef)
    <ca8>   DW_AT_name        : (indirect string, offset: 0x2bf05): TIM_HandleTypeDef
    <cac>   DW_AT_decl_file   : 10
    <cad>   DW_AT_decl_line   : 393
    <caf>   DW_AT_decl_column : 3
    <cb0>   DW_AT_type        : <0xbde>
 <1><cb4>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <cb5>   DW_AT_byte_size   : 4
    <cb6>   DW_AT_type        : <0xcba>
 <1><cba>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <cbb>   DW_AT_prototyped  : 1
    <cbb>   DW_AT_sibling     : <0xcc5>
 <2><cbf>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <cc0>   DW_AT_type        : <0xa5a>
 <2><cc4>: Abbrev Number: 0
 <1><cc5>: Abbrev Number: 2 (DW_TAG_base_type)
    <cc6>   DW_AT_byte_size   : 1
    <cc7>   DW_AT_encoding    : 8	(unsigned char)
    <cc8>   DW_AT_name        : (indirect string, offset: 0x437fc): char
 <1><ccc>: Abbrev Number: 6 (DW_TAG_const_type)
    <ccd>   DW_AT_type        : <0xcc5>
 <1><cd1>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <cd2>   DW_AT_byte_size   : 4
    <cd3>   DW_AT_type        : <0xccc>
 <1><cd7>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <cd8>   DW_AT_encoding    : 5	(signed)
    <cd9>   DW_AT_byte_size   : 4
    <cda>   DW_AT_type        : <0x85>
    <cde>   DW_AT_decl_file   : 11
    <cdf>   DW_AT_decl_line   : 82
    <ce0>   DW_AT_decl_column : 14
    <ce1>   DW_AT_sibling     : <0xe27>
 <2><ce5>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x3e149): osPriorityNone
    <cea>   DW_AT_const_value : 0
 <2><ceb>: Abbrev Number: 20 (DW_TAG_enumerator)
    <cec>   DW_AT_name        : (indirect string, offset: 0xb997e): osPriorityIdle
    <cf0>   DW_AT_const_value : 1
 <2><cf1>: Abbrev Number: 20 (DW_TAG_enumerator)
    <cf2>   DW_AT_name        : (indirect string, offset: 0xc5217): osPriorityLow
    <cf6>   DW_AT_const_value : 8
 <2><cf7>: Abbrev Number: 20 (DW_TAG_enumerator)
    <cf8>   DW_AT_name        : (indirect string, offset: 0xcb189): osPriorityLow1
    <cfc>   DW_AT_const_value : 9
 <2><cfd>: Abbrev Number: 20 (DW_TAG_enumerator)
    <cfe>   DW_AT_name        : (indirect string, offset: 0xcb198): osPriorityLow2
    <d02>   DW_AT_const_value : 10
 <2><d03>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d04>   DW_AT_name        : (indirect string, offset: 0xcb1a7): osPriorityLow3
    <d08>   DW_AT_const_value : 11
 <2><d09>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d0a>   DW_AT_name        : (indirect string, offset: 0xcb1b6): osPriorityLow4
    <d0e>   DW_AT_const_value : 12
 <2><d0f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d10>   DW_AT_name        : (indirect string, offset: 0xcb1c5): osPriorityLow5
    <d14>   DW_AT_const_value : 13
 <2><d15>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d16>   DW_AT_name        : (indirect string, offset: 0xcb1d4): osPriorityLow6
    <d1a>   DW_AT_const_value : 14
 <2><d1b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d1c>   DW_AT_name        : (indirect string, offset: 0xaa9a3): osPriorityLow7
    <d20>   DW_AT_const_value : 15
 <2><d21>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d22>   DW_AT_name        : (indirect string, offset: 0x98361): osPriorityBelowNormal
    <d26>   DW_AT_const_value : 16
 <2><d27>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d28>   DW_AT_name        : (indirect string, offset: 0x912f1): osPriorityBelowNormal1
    <d2c>   DW_AT_const_value : 17
 <2><d2d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d2e>   DW_AT_name        : (indirect string, offset: 0xb533d): osPriorityBelowNormal2
    <d32>   DW_AT_const_value : 18
 <2><d33>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d34>   DW_AT_name        : (indirect string, offset: 0x91383): osPriorityBelowNormal3
    <d38>   DW_AT_const_value : 19
 <2><d39>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d3a>   DW_AT_name        : (indirect string, offset: 0xb5372): osPriorityBelowNormal4
    <d3e>   DW_AT_const_value : 20
 <2><d3f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d40>   DW_AT_name        : (indirect string, offset: 0xb5389): osPriorityBelowNormal5
    <d44>   DW_AT_const_value : 21
 <2><d45>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d46>   DW_AT_name        : (indirect string, offset: 0xb53a0): osPriorityBelowNormal6
    <d4a>   DW_AT_const_value : 22
 <2><d4b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d4c>   DW_AT_name        : (indirect string, offset: 0xb53b7): osPriorityBelowNormal7
    <d50>   DW_AT_const_value : 23
 <2><d51>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d52>   DW_AT_name        : (indirect string, offset: 0xadd93): osPriorityNormal
    <d56>   DW_AT_const_value : 24
 <2><d57>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d58>   DW_AT_name        : (indirect string, offset: 0x211cc): osPriorityNormal1
    <d5c>   DW_AT_const_value : 25
 <2><d5d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d5e>   DW_AT_name        : (indirect string, offset: 0x211de): osPriorityNormal2
    <d62>   DW_AT_const_value : 26
 <2><d63>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d64>   DW_AT_name        : (indirect string, offset: 0x211f0): osPriorityNormal3
    <d68>   DW_AT_const_value : 27
 <2><d69>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d6a>   DW_AT_name        : (indirect string, offset: 0x21202): osPriorityNormal4
    <d6e>   DW_AT_const_value : 28
 <2><d6f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d70>   DW_AT_name        : (indirect string, offset: 0x21214): osPriorityNormal5
    <d74>   DW_AT_const_value : 29
 <2><d75>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d76>   DW_AT_name        : (indirect string, offset: 0x21226): osPriorityNormal6
    <d7a>   DW_AT_const_value : 30
 <2><d7b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x21238): osPriorityNormal7
    <d80>   DW_AT_const_value : 31
 <2><d81>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d82>   DW_AT_name        : (indirect string, offset: 0x88bed): osPriorityAboveNormal
    <d86>   DW_AT_const_value : 32
 <2><d87>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d88>   DW_AT_name        : (indirect string, offset: 0xd57d1): osPriorityAboveNormal1
    <d8c>   DW_AT_const_value : 33
 <2><d8d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d8e>   DW_AT_name        : (indirect string, offset: 0xd57e8): osPriorityAboveNormal2
    <d92>   DW_AT_const_value : 34
 <2><d93>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d94>   DW_AT_name        : (indirect string, offset: 0xd57ff): osPriorityAboveNormal3
    <d98>   DW_AT_const_value : 35
 <2><d99>: Abbrev Number: 20 (DW_TAG_enumerator)
    <d9a>   DW_AT_name        : (indirect string, offset: 0xd5816): osPriorityAboveNormal4
    <d9e>   DW_AT_const_value : 36
 <2><d9f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <da0>   DW_AT_name        : (indirect string, offset: 0xbcfff): osPriorityAboveNormal5
    <da4>   DW_AT_const_value : 37
 <2><da5>: Abbrev Number: 20 (DW_TAG_enumerator)
    <da6>   DW_AT_name        : (indirect string, offset: 0xd5843): osPriorityAboveNormal6
    <daa>   DW_AT_const_value : 38
 <2><dab>: Abbrev Number: 20 (DW_TAG_enumerator)
    <dac>   DW_AT_name        : (indirect string, offset: 0xd585a): osPriorityAboveNormal7
    <db0>   DW_AT_const_value : 39
 <2><db1>: Abbrev Number: 20 (DW_TAG_enumerator)
    <db2>   DW_AT_name        : (indirect string, offset: 0x4a89e): osPriorityHigh
    <db6>   DW_AT_const_value : 40
 <2><db7>: Abbrev Number: 20 (DW_TAG_enumerator)
    <db8>   DW_AT_name        : (indirect string, offset: 0x8d46e): osPriorityHigh1
    <dbc>   DW_AT_const_value : 41
 <2><dbd>: Abbrev Number: 20 (DW_TAG_enumerator)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x8d47e): osPriorityHigh2
    <dc2>   DW_AT_const_value : 42
 <2><dc3>: Abbrev Number: 20 (DW_TAG_enumerator)
    <dc4>   DW_AT_name        : (indirect string, offset: 0x8d48e): osPriorityHigh3
    <dc8>   DW_AT_const_value : 43
 <2><dc9>: Abbrev Number: 20 (DW_TAG_enumerator)
    <dca>   DW_AT_name        : (indirect string, offset: 0x8d49e): osPriorityHigh4
    <dce>   DW_AT_const_value : 44
 <2><dcf>: Abbrev Number: 20 (DW_TAG_enumerator)
    <dd0>   DW_AT_name        : (indirect string, offset: 0x43fe): osPriorityHigh5
    <dd4>   DW_AT_const_value : 45
 <2><dd5>: Abbrev Number: 20 (DW_TAG_enumerator)
    <dd6>   DW_AT_name        : (indirect string, offset: 0x8d4da): osPriorityHigh6
    <dda>   DW_AT_const_value : 46
 <2><ddb>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ddc>   DW_AT_name        : (indirect string, offset: 0x8d4ea): osPriorityHigh7
    <de0>   DW_AT_const_value : 47
 <2><de1>: Abbrev Number: 20 (DW_TAG_enumerator)
    <de2>   DW_AT_name        : (indirect string, offset: 0xc1b3f): osPriorityRealtime
    <de6>   DW_AT_const_value : 48
 <2><de7>: Abbrev Number: 20 (DW_TAG_enumerator)
    <de8>   DW_AT_name        : (indirect string, offset: 0x85a92): osPriorityRealtime1
    <dec>   DW_AT_const_value : 49
 <2><ded>: Abbrev Number: 20 (DW_TAG_enumerator)
    <dee>   DW_AT_name        : (indirect string, offset: 0x85aa6): osPriorityRealtime2
    <df2>   DW_AT_const_value : 50
 <2><df3>: Abbrev Number: 20 (DW_TAG_enumerator)
    <df4>   DW_AT_name        : (indirect string, offset: 0x85aba): osPriorityRealtime3
    <df8>   DW_AT_const_value : 51
 <2><df9>: Abbrev Number: 20 (DW_TAG_enumerator)
    <dfa>   DW_AT_name        : (indirect string, offset: 0x85ace): osPriorityRealtime4
    <dfe>   DW_AT_const_value : 52
 <2><dff>: Abbrev Number: 20 (DW_TAG_enumerator)
    <e00>   DW_AT_name        : (indirect string, offset: 0x85ae2): osPriorityRealtime5
    <e04>   DW_AT_const_value : 53
 <2><e05>: Abbrev Number: 20 (DW_TAG_enumerator)
    <e06>   DW_AT_name        : (indirect string, offset: 0x85af6): osPriorityRealtime6
    <e0a>   DW_AT_const_value : 54
 <2><e0b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x85b0a): osPriorityRealtime7
    <e10>   DW_AT_const_value : 55
 <2><e11>: Abbrev Number: 20 (DW_TAG_enumerator)
    <e12>   DW_AT_name        : (indirect string, offset: 0xe57): osPriorityISR
    <e16>   DW_AT_const_value : 56
 <2><e17>: Abbrev Number: 30 (DW_TAG_enumerator)
    <e18>   DW_AT_name        : (indirect string, offset: 0xbcaba): osPriorityError
    <e1c>   DW_AT_const_value : -1
 <2><e1d>: Abbrev Number: 31 (DW_TAG_enumerator)
    <e1e>   DW_AT_name        : (indirect string, offset: 0xcb7e5): osPriorityReserved
    <e22>   DW_AT_const_value : 0x7fffffff
 <2><e26>: Abbrev Number: 0
 <1><e27>: Abbrev Number: 3 (DW_TAG_typedef)
    <e28>   DW_AT_name        : (indirect string, offset: 0x9cdf6): osPriority_t
    <e2c>   DW_AT_decl_file   : 11
    <e2d>   DW_AT_decl_line   : 136
    <e2e>   DW_AT_decl_column : 3
    <e2f>   DW_AT_type        : <0xcd7>
 <1><e33>: Abbrev Number: 3 (DW_TAG_typedef)
    <e34>   DW_AT_name        : (indirect string, offset: 0x72f5c): osThreadFunc_t
    <e38>   DW_AT_decl_file   : 11
    <e39>   DW_AT_decl_line   : 139
    <e3a>   DW_AT_decl_column : 16
    <e3b>   DW_AT_type        : <0xcb4>
 <1><e3f>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <e40>   DW_AT_encoding    : 5	(signed)
    <e41>   DW_AT_byte_size   : 4
    <e42>   DW_AT_type        : <0x85>
    <e46>   DW_AT_decl_file   : 11
    <e47>   DW_AT_decl_line   : 176
    <e48>   DW_AT_decl_column : 14
    <e49>   DW_AT_sibling     : <0xe81>
 <2><e4d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <e4e>   DW_AT_name        : (indirect string, offset: 0xa3fc6): osOK
    <e52>   DW_AT_const_value : 0
 <2><e53>: Abbrev Number: 30 (DW_TAG_enumerator)
    <e54>   DW_AT_name        : (indirect string, offset: 0x6205c): osError
    <e58>   DW_AT_const_value : -1
 <2><e59>: Abbrev Number: 30 (DW_TAG_enumerator)
    <e5a>   DW_AT_name        : (indirect string, offset: 0x8c42b): osErrorTimeout
    <e5e>   DW_AT_const_value : -2
 <2><e5f>: Abbrev Number: 30 (DW_TAG_enumerator)
    <e60>   DW_AT_name        : (indirect string, offset: 0x8b86f): osErrorResource
    <e64>   DW_AT_const_value : -3
 <2><e65>: Abbrev Number: 30 (DW_TAG_enumerator)
    <e66>   DW_AT_name        : (indirect string, offset: 0x364e6): osErrorParameter
    <e6a>   DW_AT_const_value : -4
 <2><e6b>: Abbrev Number: 30 (DW_TAG_enumerator)
    <e6c>   DW_AT_name        : (indirect string, offset: 0x242d0): osErrorNoMemory
    <e70>   DW_AT_const_value : -5
 <2><e71>: Abbrev Number: 30 (DW_TAG_enumerator)
    <e72>   DW_AT_name        : (indirect string, offset: 0x38968): osErrorISR
    <e76>   DW_AT_const_value : -6
 <2><e77>: Abbrev Number: 31 (DW_TAG_enumerator)
    <e78>   DW_AT_name        : (indirect string, offset: 0x6b33a): osStatusReserved
    <e7c>   DW_AT_const_value : 0x7fffffff
 <2><e80>: Abbrev Number: 0
 <1><e81>: Abbrev Number: 3 (DW_TAG_typedef)
    <e82>   DW_AT_name        : (indirect string, offset: 0x47431): osStatus_t
    <e86>   DW_AT_decl_file   : 11
    <e87>   DW_AT_decl_line   : 185
    <e88>   DW_AT_decl_column : 3
    <e89>   DW_AT_type        : <0xe3f>
 <1><e8d>: Abbrev Number: 3 (DW_TAG_typedef)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x261f0): osThreadId_t
    <e92>   DW_AT_decl_file   : 11
    <e93>   DW_AT_decl_line   : 189
    <e94>   DW_AT_decl_column : 15
    <e95>   DW_AT_type        : <0xa5a>
 <1><e99>: Abbrev Number: 3 (DW_TAG_typedef)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x8f4e1): TZ_ModuleId_t
    <e9e>   DW_AT_decl_file   : 11
    <e9f>   DW_AT_decl_line   : 213
    <ea0>   DW_AT_decl_column : 18
    <ea1>   DW_AT_type        : <0xb5>
 <1><ea5>: Abbrev Number: 21 (DW_TAG_structure_type)
    <ea6>   DW_AT_byte_size   : 36
    <ea7>   DW_AT_decl_file   : 11
    <ea8>   DW_AT_decl_line   : 218
    <ea9>   DW_AT_decl_column : 9
    <eaa>   DW_AT_sibling     : <0xf24>
 <2><eae>: Abbrev Number: 22 (DW_TAG_member)
    <eaf>   DW_AT_name        : (indirect string, offset: 0x18401): name
    <eb3>   DW_AT_decl_file   : 11
    <eb4>   DW_AT_decl_line   : 219
    <eb5>   DW_AT_decl_column : 33
    <eb6>   DW_AT_type        : <0xcd1>
    <eba>   DW_AT_data_member_location: 0
 <2><ebb>: Abbrev Number: 22 (DW_TAG_member)
    <ebc>   DW_AT_name        : (indirect string, offset: 0x8b56b): attr_bits
    <ec0>   DW_AT_decl_file   : 11
    <ec1>   DW_AT_decl_line   : 220
    <ec2>   DW_AT_decl_column : 28
    <ec3>   DW_AT_type        : <0xb5>
    <ec7>   DW_AT_data_member_location: 4
 <2><ec8>: Abbrev Number: 22 (DW_TAG_member)
    <ec9>   DW_AT_name        : (indirect string, offset: 0x28e08): cb_mem
    <ecd>   DW_AT_decl_file   : 11
    <ece>   DW_AT_decl_line   : 221
    <ecf>   DW_AT_decl_column : 30
    <ed0>   DW_AT_type        : <0xa5a>
    <ed4>   DW_AT_data_member_location: 8
 <2><ed5>: Abbrev Number: 22 (DW_TAG_member)
    <ed6>   DW_AT_name        : (indirect string, offset: 0x5d347): cb_size
    <eda>   DW_AT_decl_file   : 11
    <edb>   DW_AT_decl_line   : 222
    <edc>   DW_AT_decl_column : 30
    <edd>   DW_AT_type        : <0xb5>
    <ee1>   DW_AT_data_member_location: 12
 <2><ee2>: Abbrev Number: 22 (DW_TAG_member)
    <ee3>   DW_AT_name        : (indirect string, offset: 0xc2488): stack_mem
    <ee7>   DW_AT_decl_file   : 11
    <ee8>   DW_AT_decl_line   : 223
    <ee9>   DW_AT_decl_column : 27
    <eea>   DW_AT_type        : <0xa5a>
    <eee>   DW_AT_data_member_location: 16
 <2><eef>: Abbrev Number: 22 (DW_TAG_member)
    <ef0>   DW_AT_name        : (indirect string, offset: 0x85b6f): stack_size
    <ef4>   DW_AT_decl_file   : 11
    <ef5>   DW_AT_decl_line   : 224
    <ef6>   DW_AT_decl_column : 27
    <ef7>   DW_AT_type        : <0xb5>
    <efb>   DW_AT_data_member_location: 20
 <2><efc>: Abbrev Number: 22 (DW_TAG_member)
    <efd>   DW_AT_name        : (indirect string, offset: 0x539fd): priority
    <f01>   DW_AT_decl_file   : 11
    <f02>   DW_AT_decl_line   : 225
    <f03>   DW_AT_decl_column : 29
    <f04>   DW_AT_type        : <0xe27>
    <f08>   DW_AT_data_member_location: 24
 <2><f09>: Abbrev Number: 22 (DW_TAG_member)
    <f0a>   DW_AT_name        : (indirect string, offset: 0x5a331): tz_module
    <f0e>   DW_AT_decl_file   : 11
    <f0f>   DW_AT_decl_line   : 226
    <f10>   DW_AT_decl_column : 28
    <f11>   DW_AT_type        : <0xe99>
    <f15>   DW_AT_data_member_location: 28
 <2><f16>: Abbrev Number: 22 (DW_TAG_member)
    <f17>   DW_AT_name        : (indirect string, offset: 0xbfb13): reserved
    <f1b>   DW_AT_decl_file   : 11
    <f1c>   DW_AT_decl_line   : 227
    <f1d>   DW_AT_decl_column : 29
    <f1e>   DW_AT_type        : <0xb5>
    <f22>   DW_AT_data_member_location: 32
 <2><f23>: Abbrev Number: 0
 <1><f24>: Abbrev Number: 3 (DW_TAG_typedef)
    <f25>   DW_AT_name        : (indirect string, offset: 0x2101e): osThreadAttr_t
    <f29>   DW_AT_decl_file   : 11
    <f2a>   DW_AT_decl_line   : 228
    <f2b>   DW_AT_decl_column : 3
    <f2c>   DW_AT_type        : <0xea5>
 <1><f30>: Abbrev Number: 6 (DW_TAG_const_type)
    <f31>   DW_AT_type        : <0xf24>
 <1><f35>: Abbrev Number: 32 (DW_TAG_variable)
    <f36>   DW_AT_name        : (indirect string, offset: 0x53f91): defaultTaskHandle
    <f3a>   DW_AT_decl_file   : 2
    <f3b>   DW_AT_decl_line   : 45
    <f3c>   DW_AT_decl_column : 14
    <f3d>   DW_AT_type        : <0xe8d>
    <f41>   DW_AT_external    : 1
    <f41>   DW_AT_location    : 5 byte block: 3 f8 1 0 20 	(DW_OP_addr: 200001f8)
 <1><f47>: Abbrev Number: 32 (DW_TAG_variable)
    <f48>   DW_AT_name        : (indirect string, offset: 0x5e00b): defaultTask_attributes
    <f4c>   DW_AT_decl_file   : 2
    <f4d>   DW_AT_decl_line   : 46
    <f4e>   DW_AT_decl_column : 22
    <f4f>   DW_AT_type        : <0xf30>
    <f53>   DW_AT_external    : 1
    <f53>   DW_AT_location    : 5 byte block: 3 10 b0 0 8 	(DW_OP_addr: 800b010)
 <1><f59>: Abbrev Number: 32 (DW_TAG_variable)
    <f5a>   DW_AT_name        : (indirect string, offset: 0xb5ca1): hidTaskHandle
    <f5e>   DW_AT_decl_file   : 2
    <f5f>   DW_AT_decl_line   : 52
    <f60>   DW_AT_decl_column : 14
    <f61>   DW_AT_type        : <0xe8d>
    <f65>   DW_AT_external    : 1
    <f65>   DW_AT_location    : 5 byte block: 3 fc 1 0 20 	(DW_OP_addr: 200001fc)
 <1><f6b>: Abbrev Number: 32 (DW_TAG_variable)
    <f6c>   DW_AT_name        : (indirect string, offset: 0xd01f4): hidTask_attributes
    <f70>   DW_AT_decl_file   : 2
    <f71>   DW_AT_decl_line   : 53
    <f72>   DW_AT_decl_column : 22
    <f73>   DW_AT_type        : <0xf30>
    <f77>   DW_AT_external    : 1
    <f77>   DW_AT_location    : 5 byte block: 3 34 b0 0 8 	(DW_OP_addr: 800b034)
 <1><f7d>: Abbrev Number: 32 (DW_TAG_variable)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x857c2): displayTaskHandle
    <f82>   DW_AT_decl_file   : 2
    <f83>   DW_AT_decl_line   : 59
    <f84>   DW_AT_decl_column : 14
    <f85>   DW_AT_type        : <0xe8d>
    <f89>   DW_AT_external    : 1
    <f89>   DW_AT_location    : 5 byte block: 3 0 2 0 20 	(DW_OP_addr: 20000200)
 <1><f8f>: Abbrev Number: 32 (DW_TAG_variable)
    <f90>   DW_AT_name        : (indirect string, offset: 0x53424): displayTask_attributes
    <f94>   DW_AT_decl_file   : 2
    <f95>   DW_AT_decl_line   : 60
    <f96>   DW_AT_decl_column : 22
    <f97>   DW_AT_type        : <0xf30>
    <f9b>   DW_AT_external    : 1
    <f9b>   DW_AT_location    : 5 byte block: 3 58 b0 0 8 	(DW_OP_addr: 800b058)
 <1><fa1>: Abbrev Number: 33 (DW_TAG_subprogram)
    <fa2>   DW_AT_external    : 1
    <fa2>   DW_AT_name        : (indirect string, offset: 0x46e6f): HAL_IncTick
    <fa6>   DW_AT_decl_file   : 12
    <fa7>   DW_AT_decl_line   : 651
    <fa9>   DW_AT_decl_column : 20
    <faa>   DW_AT_prototyped  : 1
    <faa>   DW_AT_declaration : 1
 <1><faa>: Abbrev Number: 34 (DW_TAG_subprogram)
    <fab>   DW_AT_external    : 1
    <fab>   DW_AT_name        : (indirect string, offset: 0xd3d87): osDelay
    <faf>   DW_AT_decl_file   : 11
    <fb0>   DW_AT_decl_line   : 459
    <fb2>   DW_AT_decl_column : 12
    <fb3>   DW_AT_prototyped  : 1
    <fb3>   DW_AT_type        : <0xe81>
    <fb7>   DW_AT_declaration : 1
    <fb7>   DW_AT_sibling     : <0xfc1>
 <2><fbb>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <fbc>   DW_AT_type        : <0xb5>
 <2><fc0>: Abbrev Number: 0
 <1><fc1>: Abbrev Number: 35 (DW_TAG_subprogram)
    <fc2>   DW_AT_external    : 1
    <fc2>   DW_AT_name        : (indirect string, offset: 0x113d8): MX_USB_DEVICE_Init
    <fc6>   DW_AT_decl_file   : 13
    <fc7>   DW_AT_decl_line   : 78
    <fc8>   DW_AT_decl_column : 6
    <fc9>   DW_AT_prototyped  : 1
    <fc9>   DW_AT_declaration : 1
 <1><fc9>: Abbrev Number: 33 (DW_TAG_subprogram)
    <fca>   DW_AT_external    : 1
    <fca>   DW_AT_name        : (indirect string, offset: 0xb69b8): HAL_RCCEx_EnableMSIPLLMode
    <fce>   DW_AT_decl_file   : 14
    <fcf>   DW_AT_decl_line   : 2458
    <fd1>   DW_AT_decl_column : 19
    <fd2>   DW_AT_prototyped  : 1
    <fd2>   DW_AT_declaration : 1
 <1><fd2>: Abbrev Number: 34 (DW_TAG_subprogram)
    <fd3>   DW_AT_external    : 1
    <fd3>   DW_AT_name        : (indirect string, offset: 0xb6fac): HAL_RCC_ClockConfig
    <fd7>   DW_AT_decl_file   : 8
    <fd8>   DW_AT_decl_line   : 4837
    <fda>   DW_AT_decl_column : 19
    <fdb>   DW_AT_prototyped  : 1
    <fdb>   DW_AT_type        : <0x754>
    <fdf>   DW_AT_declaration : 1
    <fdf>   DW_AT_sibling     : <0xfee>
 <2><fe3>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <fe4>   DW_AT_type        : <0xfee>
 <2><fe8>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <fe9>   DW_AT_type        : <0xb5>
 <2><fed>: Abbrev Number: 0
 <1><fee>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <fef>   DW_AT_byte_size   : 4
    <ff0>   DW_AT_type        : <0x8e8>
 <1><ff4>: Abbrev Number: 34 (DW_TAG_subprogram)
    <ff5>   DW_AT_external    : 1
    <ff5>   DW_AT_name        : (indirect string, offset: 0x93479): HAL_RCC_OscConfig
    <ff9>   DW_AT_decl_file   : 8
    <ffa>   DW_AT_decl_line   : 4836
    <ffc>   DW_AT_decl_column : 19
    <ffd>   DW_AT_prototyped  : 1
    <ffd>   DW_AT_type        : <0x754>
    <1001>   DW_AT_declaration : 1
    <1001>   DW_AT_sibling     : <0x100b>
 <2><1005>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <1006>   DW_AT_type        : <0x100b>
 <2><100a>: Abbrev Number: 0
 <1><100b>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <100c>   DW_AT_byte_size   : 4
    <100d>   DW_AT_type        : <0x891>
 <1><1011>: Abbrev Number: 33 (DW_TAG_subprogram)
    <1012>   DW_AT_external    : 1
    <1012>   DW_AT_name        : (indirect string, offset: 0xb4e9a): HAL_PWR_EnableBkUpAccess
    <1016>   DW_AT_decl_file   : 15
    <1017>   DW_AT_decl_line   : 356
    <1019>   DW_AT_decl_column : 6
    <101a>   DW_AT_prototyped  : 1
    <101a>   DW_AT_declaration : 1
 <1><101a>: Abbrev Number: 34 (DW_TAG_subprogram)
    <101b>   DW_AT_external    : 1
    <101b>   DW_AT_name        : (indirect string, offset: 0x88f5d): HAL_PWREx_ControlVoltageScaling
    <101f>   DW_AT_decl_file   : 16
    <1020>   DW_AT_decl_line   : 837
    <1022>   DW_AT_decl_column : 19
    <1023>   DW_AT_prototyped  : 1
    <1023>   DW_AT_type        : <0x754>
    <1027>   DW_AT_declaration : 1
    <1027>   DW_AT_sibling     : <0x1031>
 <2><102b>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <102c>   DW_AT_type        : <0xb5>
 <2><1030>: Abbrev Number: 0
 <1><1031>: Abbrev Number: 36 (DW_TAG_subprogram)
    <1032>   DW_AT_external    : 1
    <1032>   DW_AT_name        : (indirect string, offset: 0x312aa): osKernelStart
    <1036>   DW_AT_decl_file   : 11
    <1037>   DW_AT_decl_line   : 302
    <1039>   DW_AT_decl_column : 12
    <103a>   DW_AT_prototyped  : 1
    <103a>   DW_AT_type        : <0xe81>
    <103e>   DW_AT_declaration : 1
 <1><103e>: Abbrev Number: 34 (DW_TAG_subprogram)
    <103f>   DW_AT_external    : 1
    <103f>   DW_AT_name        : (indirect string, offset: 0x75ea1): osThreadNew
    <1043>   DW_AT_decl_file   : 11
    <1044>   DW_AT_decl_line   : 349
    <1046>   DW_AT_decl_column : 14
    <1047>   DW_AT_prototyped  : 1
    <1047>   DW_AT_type        : <0xe8d>
    <104b>   DW_AT_declaration : 1
    <104b>   DW_AT_sibling     : <0x105f>
 <2><104f>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <1050>   DW_AT_type        : <0xe33>
 <2><1054>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <1055>   DW_AT_type        : <0xa5a>
 <2><1059>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <105a>   DW_AT_type        : <0x105f>
 <2><105e>: Abbrev Number: 0
 <1><105f>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <1060>   DW_AT_byte_size   : 4
    <1061>   DW_AT_type        : <0xf30>
 <1><1065>: Abbrev Number: 36 (DW_TAG_subprogram)
    <1066>   DW_AT_external    : 1
    <1066>   DW_AT_name        : (indirect string, offset: 0xa7588): osKernelInitialize
    <106a>   DW_AT_decl_file   : 11
    <106b>   DW_AT_decl_line   : 287
    <106d>   DW_AT_decl_column : 12
    <106e>   DW_AT_prototyped  : 1
    <106e>   DW_AT_type        : <0xe81>
    <1072>   DW_AT_declaration : 1
 <1><1072>: Abbrev Number: 36 (DW_TAG_subprogram)
    <1073>   DW_AT_external    : 1
    <1073>   DW_AT_name        : (indirect string, offset: 0xc84d0): HAL_Init
    <1077>   DW_AT_decl_file   : 12
    <1078>   DW_AT_decl_line   : 636
    <107a>   DW_AT_decl_column : 19
    <107b>   DW_AT_prototyped  : 1
    <107b>   DW_AT_type        : <0x754>
    <107f>   DW_AT_declaration : 1
 <1><107f>: Abbrev Number: 37 (DW_TAG_subprogram)
    <1080>   DW_AT_external    : 1
    <1080>   DW_AT_name        : (indirect string, offset: 0x5dd04): Error_Handler
    <1084>   DW_AT_decl_file   : 2
    <1085>   DW_AT_decl_line   : 331
    <1087>   DW_AT_decl_column : 6
    <1088>   DW_AT_prototyped  : 1
    <1088>   DW_AT_low_pc      : 0x800041c
    <108c>   DW_AT_high_pc     : 0xa
    <1090>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1092>   DW_AT_GNU_all_call_sites: 1
    <1092>   DW_AT_sibling     : <0x10a8>
 <2><1096>: Abbrev Number: 38 (DW_TAG_inlined_subroutine)
    <1097>   DW_AT_abstract_origin: <0x122e>
    <109b>   DW_AT_low_pc      : 0x8000420
    <109f>   DW_AT_high_pc     : 0x4
    <10a3>   DW_AT_call_file   : 2
    <10a4>   DW_AT_call_line   : 335
    <10a6>   DW_AT_call_column : 3
 <2><10a7>: Abbrev Number: 0
 <1><10a8>: Abbrev Number: 39 (DW_TAG_subprogram)
    <10a9>   DW_AT_external    : 1
    <10a9>   DW_AT_name        : (indirect string, offset: 0xb2c86): HAL_TIM_PeriodElapsedCallback
    <10ad>   DW_AT_decl_file   : 2
    <10ae>   DW_AT_decl_line   : 314
    <10b0>   DW_AT_decl_column : 6
    <10b1>   DW_AT_prototyped  : 1
    <10b1>   DW_AT_low_pc      : 0x80003f8
    <10b5>   DW_AT_high_pc     : 0x24
    <10b9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <10bb>   DW_AT_GNU_all_tail_call_sites: 1
    <10bb>   DW_AT_sibling     : <0x10d0>
 <2><10bf>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <10c0>   DW_AT_name        : (indirect string, offset: 0x79d52): htim
    <10c4>   DW_AT_decl_file   : 2
    <10c5>   DW_AT_decl_line   : 314
    <10c7>   DW_AT_decl_column : 55
    <10c8>   DW_AT_type        : <0x10d0>
    <10cc>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><10cf>: Abbrev Number: 0
 <1><10d0>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <10d1>   DW_AT_byte_size   : 4
    <10d2>   DW_AT_type        : <0xca7>
 <1><10d6>: Abbrev Number: 39 (DW_TAG_subprogram)
    <10d7>   DW_AT_external    : 1
    <10d7>   DW_AT_name        : (indirect string, offset: 0xbb700): DisplayTask
    <10db>   DW_AT_decl_file   : 2
    <10dc>   DW_AT_decl_line   : 295
    <10de>   DW_AT_decl_column : 6
    <10df>   DW_AT_prototyped  : 1
    <10df>   DW_AT_low_pc      : 0x80003e6
    <10e3>   DW_AT_high_pc     : 0x10
    <10e7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <10e9>   DW_AT_GNU_all_tail_call_sites: 1
    <10e9>   DW_AT_sibling     : <0x10fe>
 <2><10ed>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <10ee>   DW_AT_name        : (indirect string, offset: 0x2cd9d): argument
    <10f2>   DW_AT_decl_file   : 2
    <10f3>   DW_AT_decl_line   : 295
